Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/**
 * \brief Component description for CRU
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-05-04T23:48:36Z */
#ifndef _BZ45_CRU_COMPONENT_H_
#define _BZ45_CRU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CRU                                          */
/* ************************************************************************** */

/* -------- CRU_OSCCON : (CRU Offset: 0x00) (R/W 32) CRU OSCILLATOR CONTROL REGISTER -------- */
#define CRU_OSCCON_RESETVALUE                 _U_(0x100)                                           /**<  (CRU_OSCCON) CRU OSCILLATOR CONTROL REGISTER  Reset Value */

#define CRU_OSCCON_OSWEN_Pos                  _U_(0)                                               /**< (CRU_OSCCON) Oscillator Switch Enable bit Position */
#define CRU_OSCCON_OSWEN_Msk                  (_U_(0x1) << CRU_OSCCON_OSWEN_Pos)                   /**< (CRU_OSCCON) Oscillator Switch Enable bit Mask */
#define CRU_OSCCON_OSWEN(value)               (CRU_OSCCON_OSWEN_Msk & ((value) << CRU_OSCCON_OSWEN_Pos))
#define   CRU_OSCCON_OSWEN_SWITCH_Val         _U_(0x1)                                             /**< (CRU_OSCCON) Request oscillator switch to selection specified by NOSC[3:0] bits  */
#define   CRU_OSCCON_OSWEN_SWITCH_COMPLETE_Val _U_(0x0)                                             /**< (CRU_OSCCON) Oscillator switch is complete  */
#define CRU_OSCCON_OSWEN_SWITCH               (CRU_OSCCON_OSWEN_SWITCH_Val << CRU_OSCCON_OSWEN_Pos) /**< (CRU_OSCCON) Request oscillator switch to selection specified by NOSC[3:0] bits Position  */
#define CRU_OSCCON_OSWEN_SWITCH_COMPLETE      (CRU_OSCCON_OSWEN_SWITCH_COMPLETE_Val << CRU_OSCCON_OSWEN_Pos) /**< (CRU_OSCCON) Oscillator switch is complete Position  */
#define CRU_OSCCON_SOSCEN_Pos                 _U_(1)                                               /**< (CRU_OSCCON) 32 kHz Secondary (LP) Oscillator Enable bit Position */
#define CRU_OSCCON_SOSCEN_Msk                 (_U_(0x1) << CRU_OSCCON_SOSCEN_Pos)                  /**< (CRU_OSCCON) 32 kHz Secondary (LP) Oscillator Enable bit Mask */
#define CRU_OSCCON_SOSCEN(value)              (CRU_OSCCON_SOSCEN_Msk & ((value) << CRU_OSCCON_SOSCEN_Pos))
#define   CRU_OSCCON_SOSCEN_ON_Val            _U_(0x1)                                             /**< (CRU_OSCCON) Enable Secondary Oscillator  */
#define   CRU_OSCCON_SOSCEN_OFF_Val           _U_(0x0)                                             /**< (CRU_OSCCON) Disable Secondary Oscillator  */
#define CRU_OSCCON_SOSCEN_ON                  (CRU_OSCCON_SOSCEN_ON_Val << CRU_OSCCON_SOSCEN_Pos)  /**< (CRU_OSCCON) Enable Secondary Oscillator Position  */
#define CRU_OSCCON_SOSCEN_OFF                 (CRU_OSCCON_SOSCEN_OFF_Val << CRU_OSCCON_SOSCEN_Pos) /**< (CRU_OSCCON) Disable Secondary Oscillator Position  */
#define CRU_OSCCON_CF_Pos                     _U_(3)                                               /**< (CRU_OSCCON) Clock Fail Detect bit (Read / writable / Clearable by application) Position */
#define CRU_OSCCON_CF_Msk                     (_U_(0x1) << CRU_OSCCON_CF_Pos)                      /**< (CRU_OSCCON) Clock Fail Detect bit (Read / writable / Clearable by application) Mask */
#define CRU_OSCCON_CF(value)                  (CRU_OSCCON_CF_Msk & ((value) << CRU_OSCCON_CF_Pos))
#define   CRU_OSCCON_CF_FAIL_DET_Val          _U_(0x1)                                             /**< (CRU_OSCCON) FSCM has detected clock failure  */
#define   CRU_OSCCON_CF_NO_FAILDET_Val        _U_(0x0)                                             /**< (CRU_OSCCON) FSCM has not detected clock failure  */
#define CRU_OSCCON_CF_FAIL_DET                (CRU_OSCCON_CF_FAIL_DET_Val << CRU_OSCCON_CF_Pos)    /**< (CRU_OSCCON) FSCM has detected clock failure Position  */
#define CRU_OSCCON_CF_NO_FAILDET              (CRU_OSCCON_CF_NO_FAILDET_Val << CRU_OSCCON_CF_Pos)  /**< (CRU_OSCCON) FSCM has not detected clock failure Position  */
#define CRU_OSCCON_SLPEN_Pos                  _U_(4)                                               /**< (CRU_OSCCON) Enable SLEEP Mode bit Position */
#define CRU_OSCCON_SLPEN_Msk                  (_U_(0x1) << CRU_OSCCON_SLPEN_Pos)                   /**< (CRU_OSCCON) Enable SLEEP Mode bit Mask */
#define CRU_OSCCON_SLPEN(value)               (CRU_OSCCON_SLPEN_Msk & ((value) << CRU_OSCCON_SLPEN_Pos))
#define   CRU_OSCCON_SLPEN_SLEEP_Val          _U_(0x1)                                             /**< (CRU_OSCCON) When a WAIT Instruction is executed device will enter SLEEP Mode  */
#define   CRU_OSCCON_SLPEN_IDLE_Val           _U_(0x0)                                             /**< (CRU_OSCCON) When a WAIT instruction is executed device will enter IDLE Mode  */
#define CRU_OSCCON_SLPEN_SLEEP                (CRU_OSCCON_SLPEN_SLEEP_Val << CRU_OSCCON_SLPEN_Pos) /**< (CRU_OSCCON) When a WAIT Instruction is executed device will enter SLEEP Mode Position  */
#define CRU_OSCCON_SLPEN_IDLE                 (CRU_OSCCON_SLPEN_IDLE_Val << CRU_OSCCON_SLPEN_Pos)  /**< (CRU_OSCCON) When a WAIT instruction is executed device will enter IDLE Mode Position  */
#define CRU_OSCCON_CLKLOCK_Pos                _U_(7)                                               /**< (CRU_OSCCON) Clock Lock Enabled bit Position */
#define CRU_OSCCON_CLKLOCK_Msk                (_U_(0x1) << CRU_OSCCON_CLKLOCK_Pos)                 /**< (CRU_OSCCON) Clock Lock Enabled bit Mask */
#define CRU_OSCCON_CLKLOCK(value)             (CRU_OSCCON_CLKLOCK_Msk & ((value) << CRU_OSCCON_CLKLOCK_Pos))
#define   CRU_OSCCON_CLKLOCK_LOCKED_Val       _U_(0x1)                                             /**< (CRU_OSCCON) All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV  */
#define   CRU_OSCCON_CLKLOCK_UNLOCKED_Val     _U_(0x0)                                             /**< (CRU_OSCCON) Clock and PLL selection registers are not locked, configurations may be modified  */
#define CRU_OSCCON_CLKLOCK_LOCKED             (CRU_OSCCON_CLKLOCK_LOCKED_Val << CRU_OSCCON_CLKLOCK_Pos) /**< (CRU_OSCCON) All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV Position  */
#define CRU_OSCCON_CLKLOCK_UNLOCKED           (CRU_OSCCON_CLKLOCK_UNLOCKED_Val << CRU_OSCCON_CLKLOCK_Pos) /**< (CRU_OSCCON) Clock and PLL selection registers are not locked, configurations may be modified Position  */
#define CRU_OSCCON_NOSC_Pos                   _U_(8)                                               /**< (CRU_OSCCON) New Oscillator Selection bits Position */
#define CRU_OSCCON_NOSC_Msk                   (_U_(0xF) << CRU_OSCCON_NOSC_Pos)                    /**< (CRU_OSCCON) New Oscillator Selection bits Mask */
#define CRU_OSCCON_NOSC(value)                (CRU_OSCCON_NOSC_Msk & ((value) << CRU_OSCCON_NOSC_Pos))
#define   CRU_OSCCON_NOSC_FRCDIV_Val          _U_(0x0)                                             /**< (CRU_OSCCON) Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)  */
#define   CRU_OSCCON_NOSC_SPLL_Val            _U_(0x1)                                             /**< (CRU_OSCCON) System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)  */
#define   CRU_OSCCON_NOSC_POSC_Val            _U_(0x2)                                             /**< (CRU_OSCCON) Primary Oscillator  */
#define   CRU_OSCCON_NOSC_SOSC_Val            _U_(0x3)                                             /**< (CRU_OSCCON) Secondary Oscillator (SOSC)  */
#define   CRU_OSCCON_NOSC_LPRC_Val            _U_(0x4)                                             /**< (CRU_OSCCON) Low Power RC Oscillator (LPRC)  */
#define CRU_OSCCON_NOSC_FRCDIV                (CRU_OSCCON_NOSC_FRCDIV_Val << CRU_OSCCON_NOSC_Pos)  /**< (CRU_OSCCON) Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1) Position  */
#define CRU_OSCCON_NOSC_SPLL                  (CRU_OSCCON_NOSC_SPLL_Val << CRU_OSCCON_NOSC_Pos)    /**< (CRU_OSCCON) System PLL (SPLL1 Module) (input clock and divider set by SPLLCON) Position  */
#define CRU_OSCCON_NOSC_POSC                  (CRU_OSCCON_NOSC_POSC_Val << CRU_OSCCON_NOSC_Pos)    /**< (CRU_OSCCON) Primary Oscillator Position  */
#define CRU_OSCCON_NOSC_SOSC                  (CRU_OSCCON_NOSC_SOSC_Val << CRU_OSCCON_NOSC_Pos)    /**< (CRU_OSCCON) Secondary Oscillator (SOSC) Position  */
#define CRU_OSCCON_NOSC_LPRC                  (CRU_OSCCON_NOSC_LPRC_Val << CRU_OSCCON_NOSC_Pos)    /**< (CRU_OSCCON) Low Power RC Oscillator (LPRC) Position  */
#define CRU_OSCCON_COSC_Pos                   _U_(12)                                              /**< (CRU_OSCCON) Current Oscillator Selection bits (Read-only) Position */
#define CRU_OSCCON_COSC_Msk                   (_U_(0xF) << CRU_OSCCON_COSC_Pos)                    /**< (CRU_OSCCON) Current Oscillator Selection bits (Read-only) Mask */
#define CRU_OSCCON_COSC(value)                (CRU_OSCCON_COSC_Msk & ((value) << CRU_OSCCON_COSC_Pos))
#define   CRU_OSCCON_COSC_FRCDIV_Val          _U_(0x0)                                             /**< (CRU_OSCCON) Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)  */
#define   CRU_OSCCON_COSC_SPLL_Val            _U_(0x1)                                             /**< (CRU_OSCCON) System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)  */
#define   CRU_OSCCON_COSC_POSC_Val            _U_(0x2)                                             /**< (CRU_OSCCON) Primary Oscillator- POSC  */
#define   CRU_OSCCON_COSC_SOSC_Val            _U_(0x3)                                             /**< (CRU_OSCCON) Secondary Oscillator (SOSC)  */
#define   CRU_OSCCON_COSC_LPRC_Val            _U_(0x4)                                             /**< (CRU_OSCCON) Low Power RC Oscillator (LPRC)  */
#define CRU_OSCCON_COSC_FRCDIV                (CRU_OSCCON_COSC_FRCDIV_Val << CRU_OSCCON_COSC_Pos)  /**< (CRU_OSCCON) Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1) Position  */
#define CRU_OSCCON_COSC_SPLL                  (CRU_OSCCON_COSC_SPLL_Val << CRU_OSCCON_COSC_Pos)    /**< (CRU_OSCCON) System PLL (SPLL1 Module) (input clock and divider set by SPLLCON) Position  */
#define CRU_OSCCON_COSC_POSC                  (CRU_OSCCON_COSC_POSC_Val << CRU_OSCCON_COSC_Pos)    /**< (CRU_OSCCON) Primary Oscillator- POSC Position  */
#define CRU_OSCCON_COSC_SOSC                  (CRU_OSCCON_COSC_SOSC_Val << CRU_OSCCON_COSC_Pos)    /**< (CRU_OSCCON) Secondary Oscillator (SOSC) Position  */
#define CRU_OSCCON_COSC_LPRC                  (CRU_OSCCON_COSC_LPRC_Val << CRU_OSCCON_COSC_Pos)    /**< (CRU_OSCCON) Low Power RC Oscillator (LPRC) Position  */
#define CRU_OSCCON_WAKE2SPD_Pos               _U_(21)                                              /**< (CRU_OSCCON) 2-Speed startup enabled in Sleep mode bit Position */
#define CRU_OSCCON_WAKE2SPD_Msk               (_U_(0x1) << CRU_OSCCON_WAKE2SPD_Pos)                /**< (CRU_OSCCON) 2-Speed startup enabled in Sleep mode bit Mask */
#define CRU_OSCCON_WAKE2SPD(value)            (CRU_OSCCON_WAKE2SPD_Msk & ((value) << CRU_OSCCON_WAKE2SPD_Pos))
#define   CRU_OSCCON_WAKE2SPD_FRC_Val         _U_(0x1)                                             /**< (CRU_OSCCON) When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready  */
#define   CRU_OSCCON_WAKE2SPD_SELECTED_CLK_Val _U_(0x0)                                             /**< (CRU_OSCCON) When the device EXITS Sleep Mode, the sys_clk will be from the selected clock.  */
#define CRU_OSCCON_WAKE2SPD_FRC               (CRU_OSCCON_WAKE2SPD_FRC_Val << CRU_OSCCON_WAKE2SPD_Pos) /**< (CRU_OSCCON) When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready Position  */
#define CRU_OSCCON_WAKE2SPD_SELECTED_CLK      (CRU_OSCCON_WAKE2SPD_SELECTED_CLK_Val << CRU_OSCCON_WAKE2SPD_Pos) /**< (CRU_OSCCON) When the device EXITS Sleep Mode, the sys_clk will be from the selected clock. Position  */
#define CRU_OSCCON_DRMEN_Pos                  _U_(23)                                              /**< (CRU_OSCCON) Enable Dream Mode bit Position */
#define CRU_OSCCON_DRMEN_Msk                  (_U_(0x1) << CRU_OSCCON_DRMEN_Pos)                   /**< (CRU_OSCCON) Enable Dream Mode bit Mask */
#define CRU_OSCCON_DRMEN(value)               (CRU_OSCCON_DRMEN_Msk & ((value) << CRU_OSCCON_DRMEN_Pos))
#define   CRU_OSCCON_DRMEN_SLEEP_Val          _U_(0x1)                                             /**< (CRU_OSCCON) When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered  */
#define   CRU_OSCCON_DRMEN_NO_EFFECT_Val      _U_(0x0)                                             /**< (CRU_OSCCON) DMA transfer has no effect  */
#define CRU_OSCCON_DRMEN_SLEEP                (CRU_OSCCON_DRMEN_SLEEP_Val << CRU_OSCCON_DRMEN_Pos) /**< (CRU_OSCCON) When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered Position  */
#define CRU_OSCCON_DRMEN_NO_EFFECT            (CRU_OSCCON_DRMEN_NO_EFFECT_Val << CRU_OSCCON_DRMEN_Pos) /**< (CRU_OSCCON) DMA transfer has no effect Position  */
#define CRU_OSCCON_FRCDIV_Pos                 _U_(24)                                              /**< (CRU_OSCCON) Fast RC Clock Divider bits Position */
#define CRU_OSCCON_FRCDIV_Msk                 (_U_(0x7) << CRU_OSCCON_FRCDIV_Pos)                  /**< (CRU_OSCCON) Fast RC Clock Divider bits Mask */
#define CRU_OSCCON_FRCDIV(value)              (CRU_OSCCON_FRCDIV_Msk & ((value) << CRU_OSCCON_FRCDIV_Pos))
#define   CRU_OSCCON_FRCDIV_DIV_1_Val         _U_(0x0)                                             /**< (CRU_OSCCON) FRC Divide by 1  */
#define   CRU_OSCCON_FRCDIV_DIV_2_Val         _U_(0x1)                                             /**< (CRU_OSCCON) FRC Divide by 2  */
#define   CRU_OSCCON_FRCDIV_DIV_4_Val         _U_(0x2)                                             /**< (CRU_OSCCON) FRC Divide by 4  */
#define   CRU_OSCCON_FRCDIV_DIV_8_Val         _U_(0x3)                                             /**< (CRU_OSCCON) FRC Divide by 8  */
#define   CRU_OSCCON_FRCDIV_DIV_16_Val        _U_(0x4)                                             /**< (CRU_OSCCON) FRC Divide by 16  */
#define   CRU_OSCCON_FRCDIV_DIV_32_Val        _U_(0x5)                                             /**< (CRU_OSCCON) FRC Divide by 32  */
#define   CRU_OSCCON_FRCDIV_DIV_64_Val        _U_(0x6)                                             /**< (CRU_OSCCON) FRC Divide by 64  */
#define   CRU_OSCCON_FRCDIV_DIV_256_Val       _U_(0x7)                                             /**< (CRU_OSCCON) FRC Divide by 256  */
#define CRU_OSCCON_FRCDIV_DIV_1               (CRU_OSCCON_FRCDIV_DIV_1_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 1 Position  */
#define CRU_OSCCON_FRCDIV_DIV_2               (CRU_OSCCON_FRCDIV_DIV_2_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 2 Position  */
#define CRU_OSCCON_FRCDIV_DIV_4               (CRU_OSCCON_FRCDIV_DIV_4_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 4 Position  */
#define CRU_OSCCON_FRCDIV_DIV_8               (CRU_OSCCON_FRCDIV_DIV_8_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 8 Position  */
#define CRU_OSCCON_FRCDIV_DIV_16              (CRU_OSCCON_FRCDIV_DIV_16_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 16 Position  */
#define CRU_OSCCON_FRCDIV_DIV_32              (CRU_OSCCON_FRCDIV_DIV_32_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 32 Position  */
#define CRU_OSCCON_FRCDIV_DIV_64              (CRU_OSCCON_FRCDIV_DIV_64_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 64 Position  */
#define CRU_OSCCON_FRCDIV_DIV_256             (CRU_OSCCON_FRCDIV_DIV_256_Val << CRU_OSCCON_FRCDIV_Pos) /**< (CRU_OSCCON) FRC Divide by 256 Position  */
#define CRU_OSCCON_Msk                        _U_(0x07A0FF9B)                                      /**< (CRU_OSCCON) Register Mask  */


