Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_OSCCONCLR : (CRU Offset: 0x04) (R/W 32)  -------- */
#define CRU_OSCCONCLR_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCCONCLR)   Reset Value */

#define CRU_OSCCONCLR_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCCONCLR) Register Mask  */


/* -------- CRU_OSCCONSET : (CRU Offset: 0x08) (R/W 32)  -------- */
#define CRU_OSCCONSET_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCCONSET)   Reset Value */

#define CRU_OSCCONSET_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCCONSET) Register Mask  */


/* -------- CRU_OSCCONINV : (CRU Offset: 0x0C) (R/W 32)  -------- */
#define CRU_OSCCONINV_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCCONINV)   Reset Value */

#define CRU_OSCCONINV_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCCONINV) Register Mask  */


/* -------- CRU_OSCTUN : (CRU Offset: 0x10) (R/W 32) CRU OSCILLATOR TRIMMING REGISTER -------- */
#define CRU_OSCTUN_RESETVALUE                 _U_(0x00)                                            /**<  (CRU_OSCTUN) CRU OSCILLATOR TRIMMING REGISTER  Reset Value */

#define CRU_OSCTUN_TUN_Pos                    _U_(0)                                               /**< (CRU_OSCTUN) Internal Fast RC (FRC) Oscillator Tuning bits Position */
#define CRU_OSCTUN_TUN_Msk                    (_U_(0x3F) << CRU_OSCTUN_TUN_Pos)                    /**< (CRU_OSCTUN) Internal Fast RC (FRC) Oscillator Tuning bits Mask */
#define CRU_OSCTUN_TUN(value)                 (CRU_OSCTUN_TUN_Msk & ((value) << CRU_OSCTUN_TUN_Pos))
#define   CRU_OSCTUN_TUN_Max_Val              _U_(0x1F)                                            /**< (CRU_OSCTUN) Maximum Frequency  */
#define   CRU_OSCTUN_TUN_Center_Val           _U_(0x0)                                             /**< (CRU_OSCTUN) Center Frequency, oscillator is running at calibrated frequency  */
#define   CRU_OSCTUN_TUN_Min_Val              _U_(0x20)                                            /**< (CRU_OSCTUN) Minimum Frequency  */
#define CRU_OSCTUN_TUN_Max                    (CRU_OSCTUN_TUN_Max_Val << CRU_OSCTUN_TUN_Pos)       /**< (CRU_OSCTUN) Maximum Frequency Position  */
#define CRU_OSCTUN_TUN_Center                 (CRU_OSCTUN_TUN_Center_Val << CRU_OSCTUN_TUN_Pos)    /**< (CRU_OSCTUN) Center Frequency, oscillator is running at calibrated frequency Position  */
#define CRU_OSCTUN_TUN_Min                    (CRU_OSCTUN_TUN_Min_Val << CRU_OSCTUN_TUN_Pos)       /**< (CRU_OSCTUN) Minimum Frequency Position  */
#define CRU_OSCTUN_Msk                        _U_(0x0000003F)                                      /**< (CRU_OSCTUN) Register Mask  */


/* -------- CRU_OSCTUNCLR : (CRU Offset: 0x14) (R/W 32)  -------- */
#define CRU_OSCTUNCLR_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCTUNCLR)   Reset Value */

#define CRU_OSCTUNCLR_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCTUNCLR) Register Mask  */


/* -------- CRU_OSCTUNSET : (CRU Offset: 0x18) (R/W 32)  -------- */
#define CRU_OSCTUNSET_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCTUNSET)   Reset Value */

#define CRU_OSCTUNSET_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCTUNSET) Register Mask  */


/* -------- CRU_OSCTUNINV : (CRU Offset: 0x1C) (R/W 32)  -------- */
#define CRU_OSCTUNINV_RESETVALUE              _U_(0x00)                                            /**<  (CRU_OSCTUNINV)   Reset Value */

#define CRU_OSCTUNINV_Msk                     _U_(0x00000000)                                      /**< (CRU_OSCTUNINV) Register Mask  */


/* -------- CRU_SPLLCON : (CRU Offset: 0x20) (R/W 32) SPLL CONTROL REGISTER -------- */
#define CRU_SPLLCON_RESETVALUE                _U_(0xC0000108)                                      /**<  (CRU_SPLLCON) SPLL CONTROL REGISTER  Reset Value */

#define CRU_SPLLCON_SPLLPWDN_Pos              _U_(3)                                               /**< (CRU_SPLLCON) PLL Power Down Register bit Position */
#define CRU_SPLLCON_SPLLPWDN_Msk              (_U_(0x1) << CRU_SPLLCON_SPLLPWDN_Pos)               /**< (CRU_SPLLCON) PLL Power Down Register bit Mask */
#define CRU_SPLLCON_SPLLPWDN(value)           (CRU_SPLLCON_SPLLPWDN_Msk & ((value) << CRU_SPLLCON_SPLLPWDN_Pos))
#define   CRU_SPLLCON_SPLLPWDN_PLL_OFF_Val    _U_(0x1)                                             /**< (CRU_SPLLCON) PLL is powered down  */
#define   CRU_SPLLCON_SPLLPWDN_PLL_ON_Val     _U_(0x0)                                             /**< (CRU_SPLLCON) PLL is active  */
#define CRU_SPLLCON_SPLLPWDN_PLL_OFF          (CRU_SPLLCON_SPLLPWDN_PLL_OFF_Val << CRU_SPLLCON_SPLLPWDN_Pos) /**< (CRU_SPLLCON) PLL is powered down Position  */
#define CRU_SPLLCON_SPLLPWDN_PLL_ON           (CRU_SPLLCON_SPLLPWDN_PLL_ON_Val << CRU_SPLLCON_SPLLPWDN_Pos) /**< (CRU_SPLLCON) PLL is active Position  */
#define CRU_SPLLCON_SPLLFLOCK_Pos             _U_(4)                                               /**< (CRU_SPLLCON) System PLL Force Lock Position */
#define CRU_SPLLCON_SPLLFLOCK_Msk             (_U_(0x1) << CRU_SPLLCON_SPLLFLOCK_Pos)              /**< (CRU_SPLLCON) System PLL Force Lock Mask */
#define CRU_SPLLCON_SPLLFLOCK(value)          (CRU_SPLLCON_SPLLFLOCK_Msk & ((value) << CRU_SPLLCON_SPLLFLOCK_Pos))
#define   CRU_SPLLCON_SPLLFLOCK_ASSERT_Val    _U_(0x1)                                             /**< (CRU_SPLLCON) Force the SPLL lock signal to be asserted  */
#define   CRU_SPLLCON_SPLLFLOCK_NO_ASSERT_Val _U_(0x0)                                             /**< (CRU_SPLLCON) Do not force the SPLL lock signal to be asserted  */
#define CRU_SPLLCON_SPLLFLOCK_ASSERT          (CRU_SPLLCON_SPLLFLOCK_ASSERT_Val << CRU_SPLLCON_SPLLFLOCK_Pos) /**< (CRU_SPLLCON) Force the SPLL lock signal to be asserted Position  */
#define CRU_SPLLCON_SPLLFLOCK_NO_ASSERT       (CRU_SPLLCON_SPLLFLOCK_NO_ASSERT_Val << CRU_SPLLCON_SPLLFLOCK_Pos) /**< (CRU_SPLLCON) Do not force the SPLL lock signal to be asserted Position  */
#define CRU_SPLLCON_SPLLRST_Pos               _U_(5)                                               /**< (CRU_SPLLCON) System PLL Reset Position */
#define CRU_SPLLCON_SPLLRST_Msk               (_U_(0x1) << CRU_SPLLCON_SPLLRST_Pos)                /**< (CRU_SPLLCON) System PLL Reset Mask */
#define CRU_SPLLCON_SPLLRST(value)            (CRU_SPLLCON_SPLLRST_Msk & ((value) << CRU_SPLLCON_SPLLRST_Pos))
#define   CRU_SPLLCON_SPLLRST_ASSERT_Val      _U_(0x1)                                             /**< (CRU_SPLLCON) Assert the reset to the SPLL  */
#define   CRU_SPLLCON_SPLLRST_NO_ASSERT_Val   _U_(0x0)                                             /**< (CRU_SPLLCON) De-assert the reset to the SPLL  */
#define CRU_SPLLCON_SPLLRST_ASSERT            (CRU_SPLLCON_SPLLRST_ASSERT_Val << CRU_SPLLCON_SPLLRST_Pos) /**< (CRU_SPLLCON) Assert the reset to the SPLL Position  */
#define CRU_SPLLCON_SPLLRST_NO_ASSERT         (CRU_SPLLCON_SPLLRST_NO_ASSERT_Val << CRU_SPLLCON_SPLLRST_Pos) /**< (CRU_SPLLCON) De-assert the reset to the SPLL Position  */
#define CRU_SPLLCON_SPLLPOSTDIV1_Pos          _U_(8)                                               /**< (CRU_SPLLCON) SPLL Clock 1 Divide Value, 1 to 255 Position */
#define CRU_SPLLCON_SPLLPOSTDIV1_Msk          (_U_(0xFF) << CRU_SPLLCON_SPLLPOSTDIV1_Pos)          /**< (CRU_SPLLCON) SPLL Clock 1 Divide Value, 1 to 255 Mask */
#define CRU_SPLLCON_SPLLPOSTDIV1(value)       (CRU_SPLLCON_SPLLPOSTDIV1_Msk & ((value) << CRU_SPLLCON_SPLLPOSTDIV1_Pos))
#define CRU_SPLLCON_SPLLPOSTDIV2_Pos          _U_(16)                                              /**< (CRU_SPLLCON) SPLL Clock 2 Divide Value, 1 to 15 Position */
#define CRU_SPLLCON_SPLLPOSTDIV2_Msk          (_U_(0xF) << CRU_SPLLCON_SPLLPOSTDIV2_Pos)           /**< (CRU_SPLLCON) SPLL Clock 2 Divide Value, 1 to 15 Mask */
#define CRU_SPLLCON_SPLLPOSTDIV2(value)       (CRU_SPLLCON_SPLLPOSTDIV2_Msk & ((value) << CRU_SPLLCON_SPLLPOSTDIV2_Pos))
#define   CRU_SPLLCON_SPLLPOSTDIV2_DISABLE_Val _U_(0x0)                                             /**< (CRU_SPLLCON) Disable  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_1_Val  _U_(0x1)                                             /**< (CRU_SPLLCON) Second post divide by 1  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_2_Val  _U_(0x2)                                             /**< (CRU_SPLLCON) Second post divide by 2  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_3_Val  _U_(0x3)                                             /**< (CRU_SPLLCON) Second post divide by 3  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_4_Val  _U_(0x4)                                             /**< (CRU_SPLLCON) Second post divide by 4  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_5_Val  _U_(0x5)                                             /**< (CRU_SPLLCON) Second post divide by 5  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_6_Val  _U_(0x6)                                             /**< (CRU_SPLLCON) Second post divide by 6  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_7_Val  _U_(0x7)                                             /**< (CRU_SPLLCON) Second post divide by 7  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_8_Val  _U_(0x8)                                             /**< (CRU_SPLLCON) Second post divide by 8  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_9_Val  _U_(0x9)                                             /**< (CRU_SPLLCON) Second post divide by 9  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_10_Val _U_(0xA)                                             /**< (CRU_SPLLCON) Second post divide by 10  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_11_Val _U_(0xB)                                             /**< (CRU_SPLLCON) Second post divide by 11  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_12_Val _U_(0xC)                                             /**< (CRU_SPLLCON) Second post divide by 12  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_13_Val _U_(0xD)                                             /**< (CRU_SPLLCON) Second post divide by 13  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_14_Val _U_(0xE)                                             /**< (CRU_SPLLCON) Second post divide by 14  */
#define   CRU_SPLLCON_SPLLPOSTDIV2_DIV_15_Val _U_(0xF)                                             /**< (CRU_SPLLCON) Second post divide by 15  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DISABLE      (CRU_SPLLCON_SPLLPOSTDIV2_DISABLE_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Disable Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_1        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_1_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 1 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_2        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_2_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 2 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_3        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_3_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 3 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_4        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_4_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 4 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_5        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_5_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 5 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_6        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_6_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 6 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_7        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_7_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 7 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_8        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_8_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 8 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_9        (CRU_SPLLCON_SPLLPOSTDIV2_DIV_9_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 9 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_10       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_10_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 10 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_11       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_11_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 11 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_12       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_12_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 12 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_13       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_13_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 13 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_14       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_14_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 14 Position  */
#define CRU_SPLLCON_SPLLPOSTDIV2_DIV_15       (CRU_SPLLCON_SPLLPOSTDIV2_DIV_15_Val << CRU_SPLLCON_SPLLPOSTDIV2_Pos) /**< (CRU_SPLLCON) Second post divide by 15 Position  */
#define CRU_SPLLCON_SPLL_BYP_Pos              _U_(30)                                              /**< (CRU_SPLLCON) SPLL Clock 2 Source Position */
#define CRU_SPLLCON_SPLL_BYP_Msk              (_U_(0x3) << CRU_SPLLCON_SPLL_BYP_Pos)               /**< (CRU_SPLLCON) SPLL Clock 2 Source Mask */
#define CRU_SPLLCON_SPLL_BYP(value)           (CRU_SPLLCON_SPLL_BYP_Msk & ((value) << CRU_SPLLCON_SPLL_BYP_Pos))
#define   CRU_SPLLCON_SPLL_BYP_SPLL3_Val      _U_(0x0)                                             /**< (CRU_SPLLCON) SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation.  */
#define   CRU_SPLLCON_SPLL_BYP_FRC_Val        _U_(0x3)                                             /**< (CRU_SPLLCON) FRC is used as clock source for ADC CP Clock Generation.  */
#define   CRU_SPLLCON_SPLL_BYP_POSC_Val       _U_(0x2)                                             /**< (CRU_SPLLCON) POSC is used as clock source for ADC CP Clock Generation.  */
#define CRU_SPLLCON_SPLL_BYP_SPLL3            (CRU_SPLLCON_SPLL_BYP_SPLL3_Val << CRU_SPLLCON_SPLL_BYP_Pos) /**< (CRU_SPLLCON) SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation. Position  */
#define CRU_SPLLCON_SPLL_BYP_FRC              (CRU_SPLLCON_SPLL_BYP_FRC_Val << CRU_SPLLCON_SPLL_BYP_Pos) /**< (CRU_SPLLCON) FRC is used as clock source for ADC CP Clock Generation. Position  */
#define CRU_SPLLCON_SPLL_BYP_POSC             (CRU_SPLLCON_SPLL_BYP_POSC_Val << CRU_SPLLCON_SPLL_BYP_Pos) /**< (CRU_SPLLCON) POSC is used as clock source for ADC CP Clock Generation. Position  */
#define CRU_SPLLCON_Msk                       _U_(0xC00FFF38)                                      /**< (CRU_SPLLCON) Register Mask  */


