Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_REFO1CONSET : (CRU Offset: 0x78) (R/W 32)  -------- */
#define CRU_REFO1CONSET_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO1CONSET)   Reset Value */

#define CRU_REFO1CONSET_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO1CONSET) Register Mask  */


/* -------- CRU_REFO1CONINV : (CRU Offset: 0x7C) (R/W 32)  -------- */
#define CRU_REFO1CONINV_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO1CONINV)   Reset Value */

#define CRU_REFO1CONINV_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO1CONINV) Register Mask  */


/* -------- CRU_REFO1TRIM : (CRU Offset: 0x80) (R/W 32) REFERENCE OSCILLATOR 1 TRIM REGISTER -------- */
#define CRU_REFO1TRIM_RESETVALUE              _U_(0x00)                                            /**<  (CRU_REFO1TRIM) REFERENCE OSCILLATOR 1 TRIM REGISTER  Reset Value */

#define CRU_REFO1TRIM_ROTRIM_Pos              _U_(23)                                              /**< (CRU_REFO1TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Position */
#define CRU_REFO1TRIM_ROTRIM_Msk              (_U_(0x1FF) << CRU_REFO1TRIM_ROTRIM_Pos)             /**< (CRU_REFO1TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Mask */
#define CRU_REFO1TRIM_ROTRIM(value)           (CRU_REFO1TRIM_ROTRIM_Msk & ((value) << CRU_REFO1TRIM_ROTRIM_Pos))
#define   CRU_REFO1TRIM_ROTRIM_ZERO_Val       _U_(0x0)                                             /**< (CRU_REFO1TRIM) 0/512 (0.0) divisor added to RODIV value  */
#define   CRU_REFO1TRIM_ROTRIM_1_Val          _U_(0x1)                                             /**< (CRU_REFO1TRIM) 1/512 (0.001953125) divisor added to RODIV value  */
#define   CRU_REFO1TRIM_ROTRIM_2_Val          _U_(0x2)                                             /**< (CRU_REFO1TRIM) 2/512 (0.00390625) divisor added to RODIV value  */
#define   CRU_REFO1TRIM_ROTRIM_256_Val        _U_(0x100)                                           /**< (CRU_REFO1TRIM) 256/512 (0.5000) divisor added to RODIV value  */
#define   CRU_REFO1TRIM_ROTRIM_511_Val        _U_(0x1FF)                                           /**< (CRU_REFO1TRIM) 511/512 (0.998046875) divisor added to RODIV value  */
#define CRU_REFO1TRIM_ROTRIM_ZERO             (CRU_REFO1TRIM_ROTRIM_ZERO_Val << CRU_REFO1TRIM_ROTRIM_Pos) /**< (CRU_REFO1TRIM) 0/512 (0.0) divisor added to RODIV value Position  */
#define CRU_REFO1TRIM_ROTRIM_1                (CRU_REFO1TRIM_ROTRIM_1_Val << CRU_REFO1TRIM_ROTRIM_Pos) /**< (CRU_REFO1TRIM) 1/512 (0.001953125) divisor added to RODIV value Position  */
#define CRU_REFO1TRIM_ROTRIM_2                (CRU_REFO1TRIM_ROTRIM_2_Val << CRU_REFO1TRIM_ROTRIM_Pos) /**< (CRU_REFO1TRIM) 2/512 (0.00390625) divisor added to RODIV value Position  */
#define CRU_REFO1TRIM_ROTRIM_256              (CRU_REFO1TRIM_ROTRIM_256_Val << CRU_REFO1TRIM_ROTRIM_Pos) /**< (CRU_REFO1TRIM) 256/512 (0.5000) divisor added to RODIV value Position  */
#define CRU_REFO1TRIM_ROTRIM_511              (CRU_REFO1TRIM_ROTRIM_511_Val << CRU_REFO1TRIM_ROTRIM_Pos) /**< (CRU_REFO1TRIM) 511/512 (0.998046875) divisor added to RODIV value Position  */
#define CRU_REFO1TRIM_Msk                     _U_(0xFF800000)                                      /**< (CRU_REFO1TRIM) Register Mask  */


/* -------- CRU_REFO1TRIMCLR : (CRU Offset: 0x84) (R/W 32)  -------- */
#define CRU_REFO1TRIMCLR_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO1TRIMCLR)   Reset Value */

#define CRU_REFO1TRIMCLR_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO1TRIMCLR) Register Mask  */


/* -------- CRU_REFO1TRIMSET : (CRU Offset: 0x88) (R/W 32)  -------- */
#define CRU_REFO1TRIMSET_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO1TRIMSET)   Reset Value */

#define CRU_REFO1TRIMSET_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO1TRIMSET) Register Mask  */


/* -------- CRU_REFO1TRIMINV : (CRU Offset: 0x8C) (R/W 32)  -------- */
#define CRU_REFO1TRIMINV_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO1TRIMINV)   Reset Value */

#define CRU_REFO1TRIMINV_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO1TRIMINV) Register Mask  */


/* -------- CRU_REFO2CON : (CRU Offset: 0x90) (R/W 32) REFERENCE OSCILLATOR 2 CONTROL REGISTER -------- */
#define CRU_REFO2CON_RESETVALUE               _U_(0x00)                                            /**<  (CRU_REFO2CON) REFERENCE OSCILLATOR 2 CONTROL REGISTER  Reset Value */

#define CRU_REFO2CON_ROSEL_Pos                _U_(0)                                               /**< (CRU_REFO2CON) Reference Clock Source Select bits Position */
#define CRU_REFO2CON_ROSEL_Msk                (_U_(0xF) << CRU_REFO2CON_ROSEL_Pos)                 /**< (CRU_REFO2CON) Reference Clock Source Select bits Mask */
#define CRU_REFO2CON_ROSEL(value)             (CRU_REFO2CON_ROSEL_Msk & ((value) << CRU_REFO2CON_ROSEL_Pos))
#define   CRU_REFO2CON_ROSEL_REFCLKI_Val      _U_(0x8)                                             /**< (CRU_REFO2CON) REFI Pin  */
#define   CRU_REFO2CON_ROSEL_SYSCLK_Val       _U_(0x7)                                             /**< (CRU_REFO2CON) System clock (reference clock reflects any device clock switching)  */
#define   CRU_REFO2CON_ROSEL_PBCLK1_Val       _U_(0x6)                                             /**< (CRU_REFO2CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching)  */
#define   CRU_REFO2CON_ROSEL_SPLL3_Val        _U_(0x5)                                             /**< (CRU_REFO2CON) System PLL3 (Clock-3)  */
#define   CRU_REFO2CON_ROSEL_LPRC_Val         _U_(0x4)                                             /**< (CRU_REFO2CON) LPRC  */
#define   CRU_REFO2CON_ROSEL_SOSC_Val         _U_(0x3)                                             /**< (CRU_REFO2CON) SOSC  */
#define   CRU_REFO2CON_ROSEL_POSC_Val         _U_(0x2)                                             /**< (CRU_REFO2CON) POSC  */
#define   CRU_REFO2CON_ROSEL_SPLL1_Val        _U_(0x1)                                             /**< (CRU_REFO2CON) System PLL1 (Clock-1)  */
#define   CRU_REFO2CON_ROSEL_FRC_Val          _U_(0x0)                                             /**< (CRU_REFO2CON) FRC  */
#define CRU_REFO2CON_ROSEL_REFCLKI            (CRU_REFO2CON_ROSEL_REFCLKI_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) REFI Pin Position  */
#define CRU_REFO2CON_ROSEL_SYSCLK             (CRU_REFO2CON_ROSEL_SYSCLK_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) System clock (reference clock reflects any device clock switching) Position  */
#define CRU_REFO2CON_ROSEL_PBCLK1             (CRU_REFO2CON_ROSEL_PBCLK1_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching) Position  */
#define CRU_REFO2CON_ROSEL_SPLL3              (CRU_REFO2CON_ROSEL_SPLL3_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) System PLL3 (Clock-3) Position  */
#define CRU_REFO2CON_ROSEL_LPRC               (CRU_REFO2CON_ROSEL_LPRC_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) LPRC Position  */
#define CRU_REFO2CON_ROSEL_SOSC               (CRU_REFO2CON_ROSEL_SOSC_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) SOSC Position  */
#define CRU_REFO2CON_ROSEL_POSC               (CRU_REFO2CON_ROSEL_POSC_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) POSC Position  */
#define CRU_REFO2CON_ROSEL_SPLL1              (CRU_REFO2CON_ROSEL_SPLL1_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) System PLL1 (Clock-1) Position  */
#define CRU_REFO2CON_ROSEL_FRC                (CRU_REFO2CON_ROSEL_FRC_Val << CRU_REFO2CON_ROSEL_Pos) /**< (CRU_REFO2CON) FRC Position  */
#define CRU_REFO2CON_ACTIVE_Pos               _U_(8)                                               /**< (CRU_REFO2CON) Reference Clock Request Status bit Position */
#define CRU_REFO2CON_ACTIVE_Msk               (_U_(0x1) << CRU_REFO2CON_ACTIVE_Pos)                /**< (CRU_REFO2CON) Reference Clock Request Status bit Mask */
#define CRU_REFO2CON_ACTIVE(value)            (CRU_REFO2CON_ACTIVE_Msk & ((value) << CRU_REFO2CON_ACTIVE_Pos))
#define   CRU_REFO2CON_ACTIVE_ACTIVE_Val      _U_(0x1)                                             /**< (CRU_REFO2CON) Reference clock request is active (User should not update this REFOCON register)  */
#define   CRU_REFO2CON_ACTIVE_NOT_ACTIVE_Val  _U_(0x0)                                             /**< (CRU_REFO2CON) Reference clock request is not active (User can update this REFOCON register)  */
#define CRU_REFO2CON_ACTIVE_ACTIVE            (CRU_REFO2CON_ACTIVE_ACTIVE_Val << CRU_REFO2CON_ACTIVE_Pos) /**< (CRU_REFO2CON) Reference clock request is active (User should not update this REFOCON register) Position  */
#define CRU_REFO2CON_ACTIVE_NOT_ACTIVE        (CRU_REFO2CON_ACTIVE_NOT_ACTIVE_Val << CRU_REFO2CON_ACTIVE_Pos) /**< (CRU_REFO2CON) Reference clock request is not active (User can update this REFOCON register) Position  */
#define CRU_REFO2CON_DIVSWEN_Pos              _U_(9)                                               /**< (CRU_REFO2CON) Clock RODIV/ROTRIM switch enabled. Position */
#define CRU_REFO2CON_DIVSWEN_Msk              (_U_(0x1) << CRU_REFO2CON_DIVSWEN_Pos)               /**< (CRU_REFO2CON) Clock RODIV/ROTRIM switch enabled. Mask */
#define CRU_REFO2CON_DIVSWEN(value)           (CRU_REFO2CON_DIVSWEN_Msk & ((value) << CRU_REFO2CON_DIVSWEN_Pos))
#define   CRU_REFO2CON_DIVSWEN_SWINPROGRESS_Val _U_(0x1)                                             /**< (CRU_REFO2CON) Clock Divider Switching currently in progress.  */
#define   CRU_REFO2CON_DIVSWEN_SWCOMPLETE_Val _U_(0x0)                                             /**< (CRU_REFO2CON) Clock Divider Switch has completed.  */
#define CRU_REFO2CON_DIVSWEN_SWINPROGRESS     (CRU_REFO2CON_DIVSWEN_SWINPROGRESS_Val << CRU_REFO2CON_DIVSWEN_Pos) /**< (CRU_REFO2CON) Clock Divider Switching currently in progress. Position  */
#define CRU_REFO2CON_DIVSWEN_SWCOMPLETE       (CRU_REFO2CON_DIVSWEN_SWCOMPLETE_Val << CRU_REFO2CON_DIVSWEN_Pos) /**< (CRU_REFO2CON) Clock Divider Switch has completed. Position  */
#define CRU_REFO2CON_RSLP_Pos                 _U_(11)                                              /**< (CRU_REFO2CON) Reference Oscillator Run in Sleep bit Position */
#define CRU_REFO2CON_RSLP_Msk                 (_U_(0x1) << CRU_REFO2CON_RSLP_Pos)                  /**< (CRU_REFO2CON) Reference Oscillator Run in Sleep bit Mask */
#define CRU_REFO2CON_RSLP(value)              (CRU_REFO2CON_RSLP_Msk & ((value) << CRU_REFO2CON_RSLP_Pos))
#define   CRU_REFO2CON_RSLP_RSLP_Val          _U_(0x1)                                             /**< (CRU_REFO2CON) Reference Oscillator output continues to run in Sleep  */
#define   CRU_REFO2CON_RSLP_NO_RSLP_Val       _U_(0x0)                                             /**< (CRU_REFO2CON) Reference Oscillator output is disabled in Sleep  */
#define CRU_REFO2CON_RSLP_RSLP                (CRU_REFO2CON_RSLP_RSLP_Val << CRU_REFO2CON_RSLP_Pos) /**< (CRU_REFO2CON) Reference Oscillator output continues to run in Sleep Position  */
#define CRU_REFO2CON_RSLP_NO_RSLP             (CRU_REFO2CON_RSLP_NO_RSLP_Val << CRU_REFO2CON_RSLP_Pos) /**< (CRU_REFO2CON) Reference Oscillator output is disabled in Sleep Position  */
#define CRU_REFO2CON_OE_Pos                   _U_(12)                                              /**< (CRU_REFO2CON) Reference Clock Output Enable bit Position */
#define CRU_REFO2CON_OE_Msk                   (_U_(0x1) << CRU_REFO2CON_OE_Pos)                    /**< (CRU_REFO2CON) Reference Clock Output Enable bit Mask */
#define CRU_REFO2CON_OE(value)                (CRU_REFO2CON_OE_Msk & ((value) << CRU_REFO2CON_OE_Pos))
#define   CRU_REFO2CON_OE_REFO2_OE_Val        _U_(0x1)                                             /**< (CRU_REFO2CON) Reference clock is driven out on REFO2 pin  */
#define   CRU_REFO2CON_OE_NO_REFO2_OE_Val     _U_(0x0)                                             /**< (CRU_REFO2CON) Reference clock is not driven out on REFO2 pin.  */
#define CRU_REFO2CON_OE_REFO2_OE              (CRU_REFO2CON_OE_REFO2_OE_Val << CRU_REFO2CON_OE_Pos) /**< (CRU_REFO2CON) Reference clock is driven out on REFO2 pin Position  */
#define CRU_REFO2CON_OE_NO_REFO2_OE           (CRU_REFO2CON_OE_NO_REFO2_OE_Val << CRU_REFO2CON_OE_Pos) /**< (CRU_REFO2CON) Reference clock is not driven out on REFO2 pin. Position  */
#define CRU_REFO2CON_SIDL_Pos                 _U_(13)                                              /**< (CRU_REFO2CON) Peripheral Stop in Idle Mode bit Position */
#define CRU_REFO2CON_SIDL_Msk                 (_U_(0x1) << CRU_REFO2CON_SIDL_Pos)                  /**< (CRU_REFO2CON) Peripheral Stop in Idle Mode bit Mask */
#define CRU_REFO2CON_SIDL(value)              (CRU_REFO2CON_SIDL_Msk & ((value) << CRU_REFO2CON_SIDL_Pos))
#define   CRU_REFO2CON_SIDL_SIDL_Val          _U_(0x1)                                             /**< (CRU_REFO2CON) Discontinue module operation when device enters Idle mode  */
#define   CRU_REFO2CON_SIDL_NO_SIDL_Val       _U_(0x0)                                             /**< (CRU_REFO2CON) Continue module operation in Idle mode  */
#define CRU_REFO2CON_SIDL_SIDL                (CRU_REFO2CON_SIDL_SIDL_Val << CRU_REFO2CON_SIDL_Pos) /**< (CRU_REFO2CON) Discontinue module operation when device enters Idle mode Position  */
#define CRU_REFO2CON_SIDL_NO_SIDL             (CRU_REFO2CON_SIDL_NO_SIDL_Val << CRU_REFO2CON_SIDL_Pos) /**< (CRU_REFO2CON) Continue module operation in Idle mode Position  */
#define CRU_REFO2CON_FRZ_Pos                  _U_(14)                                              /**< (CRU_REFO2CON) Freeze in Debug mode bit Position */
#define CRU_REFO2CON_FRZ_Msk                  (_U_(0x1) << CRU_REFO2CON_FRZ_Pos)                   /**< (CRU_REFO2CON) Freeze in Debug mode bit Mask */
#define CRU_REFO2CON_FRZ(value)               (CRU_REFO2CON_FRZ_Msk & ((value) << CRU_REFO2CON_FRZ_Pos))
#define   CRU_REFO2CON_FRZ_FRZ_Val            _U_(0x1)                                             /**< (CRU_REFO2CON) When emulator is in Debug mode, module freezes operation  */
#define   CRU_REFO2CON_FRZ_NO_FRZ_Val         _U_(0x0)                                             /**< (CRU_REFO2CON) When emulator is in Debug mode, module continues operation  */
#define CRU_REFO2CON_FRZ_FRZ                  (CRU_REFO2CON_FRZ_FRZ_Val << CRU_REFO2CON_FRZ_Pos)   /**< (CRU_REFO2CON) When emulator is in Debug mode, module freezes operation Position  */
#define CRU_REFO2CON_FRZ_NO_FRZ               (CRU_REFO2CON_FRZ_NO_FRZ_Val << CRU_REFO2CON_FRZ_Pos) /**< (CRU_REFO2CON) When emulator is in Debug mode, module continues operation Position  */
#define CRU_REFO2CON_ON_Pos                   _U_(15)                                              /**< (CRU_REFO2CON) Output Enable bit Position */
#define CRU_REFO2CON_ON_Msk                   (_U_(0x1) << CRU_REFO2CON_ON_Pos)                    /**< (CRU_REFO2CON) Output Enable bit Mask */
#define CRU_REFO2CON_ON(value)                (CRU_REFO2CON_ON_Msk & ((value) << CRU_REFO2CON_ON_Pos))
#define   CRU_REFO2CON_ON_ON_Val              _U_(0x1)                                             /**< (CRU_REFO2CON) Reference Oscillator Module enabled  */
#define   CRU_REFO2CON_ON_OFF_Val             _U_(0x0)                                             /**< (CRU_REFO2CON) Reference Oscillator Module disabled  */
#define CRU_REFO2CON_ON_ON                    (CRU_REFO2CON_ON_ON_Val << CRU_REFO2CON_ON_Pos)      /**< (CRU_REFO2CON) Reference Oscillator Module enabled Position  */
#define CRU_REFO2CON_ON_OFF                   (CRU_REFO2CON_ON_OFF_Val << CRU_REFO2CON_ON_Pos)     /**< (CRU_REFO2CON) Reference Oscillator Module disabled Position  */
#define CRU_REFO2CON_RODIV_Pos                _U_(16)                                              /**< (CRU_REFO2CON) Reference Clock Divider bits Position */
#define CRU_REFO2CON_RODIV_Msk                (_U_(0x7FFF) << CRU_REFO2CON_RODIV_Pos)              /**< (CRU_REFO2CON) Reference Clock Divider bits Mask */
#define CRU_REFO2CON_RODIV(value)             (CRU_REFO2CON_RODIV_Msk & ((value) << CRU_REFO2CON_RODIV_Pos))
#define   CRU_REFO2CON_RODIV_65K_Val          _U_(0x7FFF)                                          /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 65,534 (32,767 *2)  */
#define   CRU_REFO2CON_RODIV_4_Val            _U_(0x2)                                             /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 4 (2*2)  */
#define   CRU_REFO2CON_RODIV_2_Val            _U_(0x1)                                             /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 2 (1*2)  */
#define   CRU_REFO2CON_RODIV_NONE_Val         _U_(0x0)                                             /**< (CRU_REFO2CON) REFO2 clock is same frequency as Base clock (no divider)  */
#define CRU_REFO2CON_RODIV_65K                (CRU_REFO2CON_RODIV_65K_Val << CRU_REFO2CON_RODIV_Pos) /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 65,534 (32,767 *2) Position  */
#define CRU_REFO2CON_RODIV_4                  (CRU_REFO2CON_RODIV_4_Val << CRU_REFO2CON_RODIV_Pos) /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 4 (2*2) Position  */
#define CRU_REFO2CON_RODIV_2                  (CRU_REFO2CON_RODIV_2_Val << CRU_REFO2CON_RODIV_Pos) /**< (CRU_REFO2CON) REFO2 clock is Base clock frequency divided by 2 (1*2) Position  */
#define CRU_REFO2CON_RODIV_NONE               (CRU_REFO2CON_RODIV_NONE_Val << CRU_REFO2CON_RODIV_Pos) /**< (CRU_REFO2CON) REFO2 clock is same frequency as Base clock (no divider) Position  */
#define CRU_REFO2CON_Msk                      _U_(0x7FFFFB0F)                                      /**< (CRU_REFO2CON) Register Mask  */


/* -------- CRU_REFO2CONCLR : (CRU Offset: 0x94) (R/W 32)  -------- */
#define CRU_REFO2CONCLR_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO2CONCLR)   Reset Value */

#define CRU_REFO2CONCLR_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO2CONCLR) Register Mask  */


/* -------- CRU_REFO2CONSET : (CRU Offset: 0x98) (R/W 32)  -------- */
#define CRU_REFO2CONSET_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO2CONSET)   Reset Value */

#define CRU_REFO2CONSET_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO2CONSET) Register Mask  */


/* -------- CRU_REFO2CONINV : (CRU Offset: 0x9C) (R/W 32)  -------- */
#define CRU_REFO2CONINV_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO2CONINV)   Reset Value */

#define CRU_REFO2CONINV_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO2CONINV) Register Mask  */


/* -------- CRU_REFO2TRIM : (CRU Offset: 0xA0) (R/W 32) REFERENCE OSCILLATOR 2 TRIM REGISTER -------- */
#define CRU_REFO2TRIM_RESETVALUE              _U_(0x00)                                            /**<  (CRU_REFO2TRIM) REFERENCE OSCILLATOR 2 TRIM REGISTER  Reset Value */

#define CRU_REFO2TRIM_ROTRIM_Pos              _U_(23)                                              /**< (CRU_REFO2TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Position */
#define CRU_REFO2TRIM_ROTRIM_Msk              (_U_(0x1FF) << CRU_REFO2TRIM_ROTRIM_Pos)             /**< (CRU_REFO2TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Mask */
#define CRU_REFO2TRIM_ROTRIM(value)           (CRU_REFO2TRIM_ROTRIM_Msk & ((value) << CRU_REFO2TRIM_ROTRIM_Pos))
#define   CRU_REFO2TRIM_ROTRIM_ZERO_Val       _U_(0x0)                                             /**< (CRU_REFO2TRIM) 0/512 (0.0) divisor added to RODIV value  */
#define   CRU_REFO2TRIM_ROTRIM_1_Val          _U_(0x1)                                             /**< (CRU_REFO2TRIM) 1/512 (0.001953125) divisor added to RODIV value  */
#define   CRU_REFO2TRIM_ROTRIM_2_Val          _U_(0x2)                                             /**< (CRU_REFO2TRIM) 2/512 (0.00390625) divisor added to RODIV value  */
#define   CRU_REFO2TRIM_ROTRIM_256_Val        _U_(0x100)                                           /**< (CRU_REFO2TRIM) 256/512 (0.5000) divisor added to RODIV value  */
#define   CRU_REFO2TRIM_ROTRIM_511_Val        _U_(0x1FF)                                           /**< (CRU_REFO2TRIM) 511/512 (0.998046875) divisor added to RODIV value  */
#define CRU_REFO2TRIM_ROTRIM_ZERO             (CRU_REFO2TRIM_ROTRIM_ZERO_Val << CRU_REFO2TRIM_ROTRIM_Pos) /**< (CRU_REFO2TRIM) 0/512 (0.0) divisor added to RODIV value Position  */
#define CRU_REFO2TRIM_ROTRIM_1                (CRU_REFO2TRIM_ROTRIM_1_Val << CRU_REFO2TRIM_ROTRIM_Pos) /**< (CRU_REFO2TRIM) 1/512 (0.001953125) divisor added to RODIV value Position  */
#define CRU_REFO2TRIM_ROTRIM_2                (CRU_REFO2TRIM_ROTRIM_2_Val << CRU_REFO2TRIM_ROTRIM_Pos) /**< (CRU_REFO2TRIM) 2/512 (0.00390625) divisor added to RODIV value Position  */
#define CRU_REFO2TRIM_ROTRIM_256              (CRU_REFO2TRIM_ROTRIM_256_Val << CRU_REFO2TRIM_ROTRIM_Pos) /**< (CRU_REFO2TRIM) 256/512 (0.5000) divisor added to RODIV value Position  */
#define CRU_REFO2TRIM_ROTRIM_511              (CRU_REFO2TRIM_ROTRIM_511_Val << CRU_REFO2TRIM_ROTRIM_Pos) /**< (CRU_REFO2TRIM) 511/512 (0.998046875) divisor added to RODIV value Position  */
#define CRU_REFO2TRIM_Msk                     _U_(0xFF800000)                                      /**< (CRU_REFO2TRIM) Register Mask  */


/* -------- CRU_REFO2TRIMCLR : (CRU Offset: 0xA4) (R/W 32)  -------- */
#define CRU_REFO2TRIMCLR_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO2TRIMCLR)   Reset Value */

#define CRU_REFO2TRIMCLR_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO2TRIMCLR) Register Mask  */


