Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_REFO3TRIMCLR : (CRU Offset: 0xC4) (R/W 32)  -------- */
#define CRU_REFO3TRIMCLR_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO3TRIMCLR)   Reset Value */

#define CRU_REFO3TRIMCLR_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO3TRIMCLR) Register Mask  */


/* -------- CRU_REFO3TRIMSET : (CRU Offset: 0xC8) (R/W 32)  -------- */
#define CRU_REFO3TRIMSET_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO3TRIMSET)   Reset Value */

#define CRU_REFO3TRIMSET_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO3TRIMSET) Register Mask  */


/* -------- CRU_REFO3TRIMINV : (CRU Offset: 0xCC) (R/W 32)  -------- */
#define CRU_REFO3TRIMINV_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO3TRIMINV)   Reset Value */

#define CRU_REFO3TRIMINV_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO3TRIMINV) Register Mask  */


/* -------- CRU_REFO4CON : (CRU Offset: 0xD0) (R/W 32) REFERENCE OSCILLATOR 4 CONTROL REGISTER -------- */
#define CRU_REFO4CON_RESETVALUE               _U_(0x00)                                            /**<  (CRU_REFO4CON) REFERENCE OSCILLATOR 4 CONTROL REGISTER  Reset Value */

#define CRU_REFO4CON_ROSEL_Pos                _U_(0)                                               /**< (CRU_REFO4CON) Reference Clock Source Select bits Position */
#define CRU_REFO4CON_ROSEL_Msk                (_U_(0xF) << CRU_REFO4CON_ROSEL_Pos)                 /**< (CRU_REFO4CON) Reference Clock Source Select bits Mask */
#define CRU_REFO4CON_ROSEL(value)             (CRU_REFO4CON_ROSEL_Msk & ((value) << CRU_REFO4CON_ROSEL_Pos))
#define   CRU_REFO4CON_ROSEL_REFCLKI_Val      _U_(0x8)                                             /**< (CRU_REFO4CON) REFI Pin  */
#define   CRU_REFO4CON_ROSEL_SYSCLK_Val       _U_(0x7)                                             /**< (CRU_REFO4CON) System clock (reference clock reflects any device clock switching)  */
#define   CRU_REFO4CON_ROSEL_PBCLK1_Val       _U_(0x6)                                             /**< (CRU_REFO4CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching)  */
#define   CRU_REFO4CON_ROSEL_SPLL3_Val        _U_(0x5)                                             /**< (CRU_REFO4CON) System PLL3 (Clock-3)  */
#define   CRU_REFO4CON_ROSEL_LPRC_Val         _U_(0x4)                                             /**< (CRU_REFO4CON) LPRC  */
#define   CRU_REFO4CON_ROSEL_SOSC_Val         _U_(0x3)                                             /**< (CRU_REFO4CON) SOSC  */
#define   CRU_REFO4CON_ROSEL_POSC_Val         _U_(0x2)                                             /**< (CRU_REFO4CON) POSC  */
#define   CRU_REFO4CON_ROSEL_SPLL1_Val        _U_(0x1)                                             /**< (CRU_REFO4CON) System PLL1 (Clock-1)  */
#define   CRU_REFO4CON_ROSEL_FRC_Val          _U_(0x0)                                             /**< (CRU_REFO4CON) FRC  */
#define CRU_REFO4CON_ROSEL_REFCLKI            (CRU_REFO4CON_ROSEL_REFCLKI_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) REFI Pin Position  */
#define CRU_REFO4CON_ROSEL_SYSCLK             (CRU_REFO4CON_ROSEL_SYSCLK_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) System clock (reference clock reflects any device clock switching) Position  */
#define CRU_REFO4CON_ROSEL_PBCLK1             (CRU_REFO4CON_ROSEL_PBCLK1_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching) Position  */
#define CRU_REFO4CON_ROSEL_SPLL3              (CRU_REFO4CON_ROSEL_SPLL3_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) System PLL3 (Clock-3) Position  */
#define CRU_REFO4CON_ROSEL_LPRC               (CRU_REFO4CON_ROSEL_LPRC_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) LPRC Position  */
#define CRU_REFO4CON_ROSEL_SOSC               (CRU_REFO4CON_ROSEL_SOSC_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) SOSC Position  */
#define CRU_REFO4CON_ROSEL_POSC               (CRU_REFO4CON_ROSEL_POSC_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) POSC Position  */
#define CRU_REFO4CON_ROSEL_SPLL1              (CRU_REFO4CON_ROSEL_SPLL1_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) System PLL1 (Clock-1) Position  */
#define CRU_REFO4CON_ROSEL_FRC                (CRU_REFO4CON_ROSEL_FRC_Val << CRU_REFO4CON_ROSEL_Pos) /**< (CRU_REFO4CON) FRC Position  */
#define CRU_REFO4CON_ACTIVE_Pos               _U_(8)                                               /**< (CRU_REFO4CON) Reference Clock Request Status bit Position */
#define CRU_REFO4CON_ACTIVE_Msk               (_U_(0x1) << CRU_REFO4CON_ACTIVE_Pos)                /**< (CRU_REFO4CON) Reference Clock Request Status bit Mask */
#define CRU_REFO4CON_ACTIVE(value)            (CRU_REFO4CON_ACTIVE_Msk & ((value) << CRU_REFO4CON_ACTIVE_Pos))
#define   CRU_REFO4CON_ACTIVE_ACTIVE_Val      _U_(0x1)                                             /**< (CRU_REFO4CON) Reference clock request is active (User should not update this REFOCON register)  */
#define   CRU_REFO4CON_ACTIVE_NOT_ACTIVE_Val  _U_(0x0)                                             /**< (CRU_REFO4CON) Reference clock request is not active (User can update this REFOCON register)  */
#define CRU_REFO4CON_ACTIVE_ACTIVE            (CRU_REFO4CON_ACTIVE_ACTIVE_Val << CRU_REFO4CON_ACTIVE_Pos) /**< (CRU_REFO4CON) Reference clock request is active (User should not update this REFOCON register) Position  */
#define CRU_REFO4CON_ACTIVE_NOT_ACTIVE        (CRU_REFO4CON_ACTIVE_NOT_ACTIVE_Val << CRU_REFO4CON_ACTIVE_Pos) /**< (CRU_REFO4CON) Reference clock request is not active (User can update this REFOCON register) Position  */
#define CRU_REFO4CON_DIVSWEN_Pos              _U_(9)                                               /**< (CRU_REFO4CON) Clock RODIV/ROTRIM switch enabled. Position */
#define CRU_REFO4CON_DIVSWEN_Msk              (_U_(0x1) << CRU_REFO4CON_DIVSWEN_Pos)               /**< (CRU_REFO4CON) Clock RODIV/ROTRIM switch enabled. Mask */
#define CRU_REFO4CON_DIVSWEN(value)           (CRU_REFO4CON_DIVSWEN_Msk & ((value) << CRU_REFO4CON_DIVSWEN_Pos))
#define   CRU_REFO4CON_DIVSWEN_SWINPROGRESS_Val _U_(0x1)                                             /**< (CRU_REFO4CON) Clock Divider Switching currently in progress.  */
#define   CRU_REFO4CON_DIVSWEN_SWCOMPLETE_Val _U_(0x0)                                             /**< (CRU_REFO4CON) Clock Divider Switch has completed.  */
#define CRU_REFO4CON_DIVSWEN_SWINPROGRESS     (CRU_REFO4CON_DIVSWEN_SWINPROGRESS_Val << CRU_REFO4CON_DIVSWEN_Pos) /**< (CRU_REFO4CON) Clock Divider Switching currently in progress. Position  */
#define CRU_REFO4CON_DIVSWEN_SWCOMPLETE       (CRU_REFO4CON_DIVSWEN_SWCOMPLETE_Val << CRU_REFO4CON_DIVSWEN_Pos) /**< (CRU_REFO4CON) Clock Divider Switch has completed. Position  */
#define CRU_REFO4CON_RSLP_Pos                 _U_(11)                                              /**< (CRU_REFO4CON) Reference Oscillator Run in Sleep bit Position */
#define CRU_REFO4CON_RSLP_Msk                 (_U_(0x1) << CRU_REFO4CON_RSLP_Pos)                  /**< (CRU_REFO4CON) Reference Oscillator Run in Sleep bit Mask */
#define CRU_REFO4CON_RSLP(value)              (CRU_REFO4CON_RSLP_Msk & ((value) << CRU_REFO4CON_RSLP_Pos))
#define   CRU_REFO4CON_RSLP_RSLP_Val          _U_(0x1)                                             /**< (CRU_REFO4CON) Reference Oscillator output continues to run in Sleep  */
#define   CRU_REFO4CON_RSLP_NO_RSLP_Val       _U_(0x0)                                             /**< (CRU_REFO4CON) Reference Oscillator output is disabled in Sleep  */
#define CRU_REFO4CON_RSLP_RSLP                (CRU_REFO4CON_RSLP_RSLP_Val << CRU_REFO4CON_RSLP_Pos) /**< (CRU_REFO4CON) Reference Oscillator output continues to run in Sleep Position  */
#define CRU_REFO4CON_RSLP_NO_RSLP             (CRU_REFO4CON_RSLP_NO_RSLP_Val << CRU_REFO4CON_RSLP_Pos) /**< (CRU_REFO4CON) Reference Oscillator output is disabled in Sleep Position  */
#define CRU_REFO4CON_OE_Pos                   _U_(12)                                              /**< (CRU_REFO4CON) Reference Clock Output Enable bit Position */
#define CRU_REFO4CON_OE_Msk                   (_U_(0x1) << CRU_REFO4CON_OE_Pos)                    /**< (CRU_REFO4CON) Reference Clock Output Enable bit Mask */
#define CRU_REFO4CON_OE(value)                (CRU_REFO4CON_OE_Msk & ((value) << CRU_REFO4CON_OE_Pos))
#define   CRU_REFO4CON_OE_REFO4_OE_Val        _U_(0x1)                                             /**< (CRU_REFO4CON) Reference clock is driven out on REFO4 pin  */
#define   CRU_REFO4CON_OE_NO_REFO4_OE_Val     _U_(0x0)                                             /**< (CRU_REFO4CON) Reference clock is not driven out on REFO4 pin.  */
#define CRU_REFO4CON_OE_REFO4_OE              (CRU_REFO4CON_OE_REFO4_OE_Val << CRU_REFO4CON_OE_Pos) /**< (CRU_REFO4CON) Reference clock is driven out on REFO4 pin Position  */
#define CRU_REFO4CON_OE_NO_REFO4_OE           (CRU_REFO4CON_OE_NO_REFO4_OE_Val << CRU_REFO4CON_OE_Pos) /**< (CRU_REFO4CON) Reference clock is not driven out on REFO4 pin. Position  */
#define CRU_REFO4CON_SIDL_Pos                 _U_(13)                                              /**< (CRU_REFO4CON) Peripheral Stop in Idle Mode bit Position */
#define CRU_REFO4CON_SIDL_Msk                 (_U_(0x1) << CRU_REFO4CON_SIDL_Pos)                  /**< (CRU_REFO4CON) Peripheral Stop in Idle Mode bit Mask */
#define CRU_REFO4CON_SIDL(value)              (CRU_REFO4CON_SIDL_Msk & ((value) << CRU_REFO4CON_SIDL_Pos))
#define   CRU_REFO4CON_SIDL_SIDL_Val          _U_(0x1)                                             /**< (CRU_REFO4CON) Discontinue module operation when device enters Idle mode  */
#define   CRU_REFO4CON_SIDL_NO_SIDL_Val       _U_(0x0)                                             /**< (CRU_REFO4CON) Continue module operation in Idle mode  */
#define CRU_REFO4CON_SIDL_SIDL                (CRU_REFO4CON_SIDL_SIDL_Val << CRU_REFO4CON_SIDL_Pos) /**< (CRU_REFO4CON) Discontinue module operation when device enters Idle mode Position  */
#define CRU_REFO4CON_SIDL_NO_SIDL             (CRU_REFO4CON_SIDL_NO_SIDL_Val << CRU_REFO4CON_SIDL_Pos) /**< (CRU_REFO4CON) Continue module operation in Idle mode Position  */
#define CRU_REFO4CON_FRZ_Pos                  _U_(14)                                              /**< (CRU_REFO4CON) Freeze in Debug mode bit Position */
#define CRU_REFO4CON_FRZ_Msk                  (_U_(0x1) << CRU_REFO4CON_FRZ_Pos)                   /**< (CRU_REFO4CON) Freeze in Debug mode bit Mask */
#define CRU_REFO4CON_FRZ(value)               (CRU_REFO4CON_FRZ_Msk & ((value) << CRU_REFO4CON_FRZ_Pos))
#define   CRU_REFO4CON_FRZ_FRZ_Val            _U_(0x1)                                             /**< (CRU_REFO4CON) When emulator is in Debug mode, module freezes operation  */
#define   CRU_REFO4CON_FRZ_NO_FRZ_Val         _U_(0x0)                                             /**< (CRU_REFO4CON) When emulator is in Debug mode, module continues operation  */
#define CRU_REFO4CON_FRZ_FRZ                  (CRU_REFO4CON_FRZ_FRZ_Val << CRU_REFO4CON_FRZ_Pos)   /**< (CRU_REFO4CON) When emulator is in Debug mode, module freezes operation Position  */
#define CRU_REFO4CON_FRZ_NO_FRZ               (CRU_REFO4CON_FRZ_NO_FRZ_Val << CRU_REFO4CON_FRZ_Pos) /**< (CRU_REFO4CON) When emulator is in Debug mode, module continues operation Position  */
#define CRU_REFO4CON_ON_Pos                   _U_(15)                                              /**< (CRU_REFO4CON) Output Enable bit Position */
#define CRU_REFO4CON_ON_Msk                   (_U_(0x1) << CRU_REFO4CON_ON_Pos)                    /**< (CRU_REFO4CON) Output Enable bit Mask */
#define CRU_REFO4CON_ON(value)                (CRU_REFO4CON_ON_Msk & ((value) << CRU_REFO4CON_ON_Pos))
#define   CRU_REFO4CON_ON_ON_Val              _U_(0x1)                                             /**< (CRU_REFO4CON) Reference Oscillator Module enabled  */
#define   CRU_REFO4CON_ON_OFF_Val             _U_(0x0)                                             /**< (CRU_REFO4CON) Reference Oscillator Module disabled  */
#define CRU_REFO4CON_ON_ON                    (CRU_REFO4CON_ON_ON_Val << CRU_REFO4CON_ON_Pos)      /**< (CRU_REFO4CON) Reference Oscillator Module enabled Position  */
#define CRU_REFO4CON_ON_OFF                   (CRU_REFO4CON_ON_OFF_Val << CRU_REFO4CON_ON_Pos)     /**< (CRU_REFO4CON) Reference Oscillator Module disabled Position  */
#define CRU_REFO4CON_RODIV_Pos                _U_(16)                                              /**< (CRU_REFO4CON) Reference Clock Divider bits Position */
#define CRU_REFO4CON_RODIV_Msk                (_U_(0x7FFF) << CRU_REFO4CON_RODIV_Pos)              /**< (CRU_REFO4CON) Reference Clock Divider bits Mask */
#define CRU_REFO4CON_RODIV(value)             (CRU_REFO4CON_RODIV_Msk & ((value) << CRU_REFO4CON_RODIV_Pos))
#define   CRU_REFO4CON_RODIV_65K_Val          _U_(0x7FFF)                                          /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 65,534 (32,767 *2)  */
#define   CRU_REFO4CON_RODIV_4_Val            _U_(0x2)                                             /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 4 (2*2)  */
#define   CRU_REFO4CON_RODIV_2_Val            _U_(0x1)                                             /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 2 (1*2)  */
#define   CRU_REFO4CON_RODIV_NONE_Val         _U_(0x0)                                             /**< (CRU_REFO4CON) REFO4 clock is same frequency as Base clock (no divider)  */
#define CRU_REFO4CON_RODIV_65K                (CRU_REFO4CON_RODIV_65K_Val << CRU_REFO4CON_RODIV_Pos) /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 65,534 (32,767 *2) Position  */
#define CRU_REFO4CON_RODIV_4                  (CRU_REFO4CON_RODIV_4_Val << CRU_REFO4CON_RODIV_Pos) /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 4 (2*2) Position  */
#define CRU_REFO4CON_RODIV_2                  (CRU_REFO4CON_RODIV_2_Val << CRU_REFO4CON_RODIV_Pos) /**< (CRU_REFO4CON) REFO4 clock is Base clock frequency divided by 2 (1*2) Position  */
#define CRU_REFO4CON_RODIV_NONE               (CRU_REFO4CON_RODIV_NONE_Val << CRU_REFO4CON_RODIV_Pos) /**< (CRU_REFO4CON) REFO4 clock is same frequency as Base clock (no divider) Position  */
#define CRU_REFO4CON_Msk                      _U_(0x7FFFFB0F)                                      /**< (CRU_REFO4CON) Register Mask  */


