Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_REFO4CONCLR : (CRU Offset: 0xD4) (R/W 32)  -------- */
#define CRU_REFO4CONCLR_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO4CONCLR)   Reset Value */

#define CRU_REFO4CONCLR_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO4CONCLR) Register Mask  */


/* -------- CRU_REFO4CONSET : (CRU Offset: 0xD8) (R/W 32)  -------- */
#define CRU_REFO4CONSET_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO4CONSET)   Reset Value */

#define CRU_REFO4CONSET_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO4CONSET) Register Mask  */


/* -------- CRU_REFO4CONINV : (CRU Offset: 0xDC) (R/W 32)  -------- */
#define CRU_REFO4CONINV_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO4CONINV)   Reset Value */

#define CRU_REFO4CONINV_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO4CONINV) Register Mask  */


/* -------- CRU_REFO4TRIM : (CRU Offset: 0xE0) (R/W 32) REFERENCE OSCILLATOR 4 TRIM REGISTER -------- */
#define CRU_REFO4TRIM_RESETVALUE              _U_(0x00)                                            /**<  (CRU_REFO4TRIM) REFERENCE OSCILLATOR 4 TRIM REGISTER  Reset Value */

#define CRU_REFO4TRIM_ROTRIM_Pos              _U_(23)                                              /**< (CRU_REFO4TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Position */
#define CRU_REFO4TRIM_ROTRIM_Msk              (_U_(0x1FF) << CRU_REFO4TRIM_ROTRIM_Pos)             /**< (CRU_REFO4TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Mask */
#define CRU_REFO4TRIM_ROTRIM(value)           (CRU_REFO4TRIM_ROTRIM_Msk & ((value) << CRU_REFO4TRIM_ROTRIM_Pos))
#define   CRU_REFO4TRIM_ROTRIM_ZERO_Val       _U_(0x0)                                             /**< (CRU_REFO4TRIM) 0/512 (0.0) divisor added to RODIV value  */
#define   CRU_REFO4TRIM_ROTRIM_1_Val          _U_(0x1)                                             /**< (CRU_REFO4TRIM) 1/512 (0.001953125) divisor added to RODIV value  */
#define   CRU_REFO4TRIM_ROTRIM_2_Val          _U_(0x2)                                             /**< (CRU_REFO4TRIM) 2/512 (0.00390625) divisor added to RODIV value  */
#define   CRU_REFO4TRIM_ROTRIM_256_Val        _U_(0x100)                                           /**< (CRU_REFO4TRIM) 256/512 (0.5000) divisor added to RODIV value  */
#define   CRU_REFO4TRIM_ROTRIM_511_Val        _U_(0x1FF)                                           /**< (CRU_REFO4TRIM) 511/512 (0.998046875) divisor added to RODIV value  */
#define CRU_REFO4TRIM_ROTRIM_ZERO             (CRU_REFO4TRIM_ROTRIM_ZERO_Val << CRU_REFO4TRIM_ROTRIM_Pos) /**< (CRU_REFO4TRIM) 0/512 (0.0) divisor added to RODIV value Position  */
#define CRU_REFO4TRIM_ROTRIM_1                (CRU_REFO4TRIM_ROTRIM_1_Val << CRU_REFO4TRIM_ROTRIM_Pos) /**< (CRU_REFO4TRIM) 1/512 (0.001953125) divisor added to RODIV value Position  */
#define CRU_REFO4TRIM_ROTRIM_2                (CRU_REFO4TRIM_ROTRIM_2_Val << CRU_REFO4TRIM_ROTRIM_Pos) /**< (CRU_REFO4TRIM) 2/512 (0.00390625) divisor added to RODIV value Position  */
#define CRU_REFO4TRIM_ROTRIM_256              (CRU_REFO4TRIM_ROTRIM_256_Val << CRU_REFO4TRIM_ROTRIM_Pos) /**< (CRU_REFO4TRIM) 256/512 (0.5000) divisor added to RODIV value Position  */
#define CRU_REFO4TRIM_ROTRIM_511              (CRU_REFO4TRIM_ROTRIM_511_Val << CRU_REFO4TRIM_ROTRIM_Pos) /**< (CRU_REFO4TRIM) 511/512 (0.998046875) divisor added to RODIV value Position  */
#define CRU_REFO4TRIM_Msk                     _U_(0xFF800000)                                      /**< (CRU_REFO4TRIM) Register Mask  */


/* -------- CRU_REFO4TRIMCLR : (CRU Offset: 0xE4) (R/W 32)  -------- */
#define CRU_REFO4TRIMCLR_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO4TRIMCLR)   Reset Value */

#define CRU_REFO4TRIMCLR_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO4TRIMCLR) Register Mask  */


/* -------- CRU_REFO4TRIMSET : (CRU Offset: 0xE8) (R/W 32)  -------- */
#define CRU_REFO4TRIMSET_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO4TRIMSET)   Reset Value */

#define CRU_REFO4TRIMSET_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO4TRIMSET) Register Mask  */


/* -------- CRU_REFO4TRIMINV : (CRU Offset: 0xEC) (R/W 32)  -------- */
#define CRU_REFO4TRIMINV_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO4TRIMINV)   Reset Value */

#define CRU_REFO4TRIMINV_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO4TRIMINV) Register Mask  */


/* -------- CRU_REFO5CON : (CRU Offset: 0xF0) (R/W 32) REFERENCE OSCILLATOR 5 CONTROL REGISTER -------- */
#define CRU_REFO5CON_RESETVALUE               _U_(0x00)                                            /**<  (CRU_REFO5CON) REFERENCE OSCILLATOR 5 CONTROL REGISTER  Reset Value */

#define CRU_REFO5CON_ROSEL_Pos                _U_(0)                                               /**< (CRU_REFO5CON) Reference Clock Source Select bits Position */
#define CRU_REFO5CON_ROSEL_Msk                (_U_(0xF) << CRU_REFO5CON_ROSEL_Pos)                 /**< (CRU_REFO5CON) Reference Clock Source Select bits Mask */
#define CRU_REFO5CON_ROSEL(value)             (CRU_REFO5CON_ROSEL_Msk & ((value) << CRU_REFO5CON_ROSEL_Pos))
#define   CRU_REFO5CON_ROSEL_REFCLKI_Val      _U_(0x8)                                             /**< (CRU_REFO5CON) REFI Pin  */
#define   CRU_REFO5CON_ROSEL_SYSCLK_Val       _U_(0x7)                                             /**< (CRU_REFO5CON) System clock (reference clock reflects any device clock switching)  */
#define   CRU_REFO5CON_ROSEL_PBCLK1_Val       _U_(0x6)                                             /**< (CRU_REFO5CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching)  */
#define   CRU_REFO5CON_ROSEL_SPLL3_Val        _U_(0x5)                                             /**< (CRU_REFO5CON) System PLL3 (Clock-3)  */
#define   CRU_REFO5CON_ROSEL_LPRC_Val         _U_(0x4)                                             /**< (CRU_REFO5CON) LPRC  */
#define   CRU_REFO5CON_ROSEL_SOSC_Val         _U_(0x3)                                             /**< (CRU_REFO5CON) SOSC  */
#define   CRU_REFO5CON_ROSEL_POSC_Val         _U_(0x2)                                             /**< (CRU_REFO5CON) POSC  */
#define   CRU_REFO5CON_ROSEL_SPLL1_Val        _U_(0x1)                                             /**< (CRU_REFO5CON) System PLL1 (Clock-1)  */
#define   CRU_REFO5CON_ROSEL_FRC_Val          _U_(0x0)                                             /**< (CRU_REFO5CON) FRC  */
#define CRU_REFO5CON_ROSEL_REFCLKI            (CRU_REFO5CON_ROSEL_REFCLKI_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) REFI Pin Position  */
#define CRU_REFO5CON_ROSEL_SYSCLK             (CRU_REFO5CON_ROSEL_SYSCLK_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) System clock (reference clock reflects any device clock switching) Position  */
#define CRU_REFO5CON_ROSEL_PBCLK1             (CRU_REFO5CON_ROSEL_PBCLK1_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching) Position  */
#define CRU_REFO5CON_ROSEL_SPLL3              (CRU_REFO5CON_ROSEL_SPLL3_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) System PLL3 (Clock-3) Position  */
#define CRU_REFO5CON_ROSEL_LPRC               (CRU_REFO5CON_ROSEL_LPRC_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) LPRC Position  */
#define CRU_REFO5CON_ROSEL_SOSC               (CRU_REFO5CON_ROSEL_SOSC_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) SOSC Position  */
#define CRU_REFO5CON_ROSEL_POSC               (CRU_REFO5CON_ROSEL_POSC_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) POSC Position  */
#define CRU_REFO5CON_ROSEL_SPLL1              (CRU_REFO5CON_ROSEL_SPLL1_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) System PLL1 (Clock-1) Position  */
#define CRU_REFO5CON_ROSEL_FRC                (CRU_REFO5CON_ROSEL_FRC_Val << CRU_REFO5CON_ROSEL_Pos) /**< (CRU_REFO5CON) FRC Position  */
#define CRU_REFO5CON_ACTIVE_Pos               _U_(8)                                               /**< (CRU_REFO5CON) Reference Clock Request Status bit Position */
#define CRU_REFO5CON_ACTIVE_Msk               (_U_(0x1) << CRU_REFO5CON_ACTIVE_Pos)                /**< (CRU_REFO5CON) Reference Clock Request Status bit Mask */
#define CRU_REFO5CON_ACTIVE(value)            (CRU_REFO5CON_ACTIVE_Msk & ((value) << CRU_REFO5CON_ACTIVE_Pos))
#define   CRU_REFO5CON_ACTIVE_ACTIVE_Val      _U_(0x1)                                             /**< (CRU_REFO5CON) Reference clock request is active (User should not update this REFOCON register)  */
#define   CRU_REFO5CON_ACTIVE_NOT_ACTIVE_Val  _U_(0x0)                                             /**< (CRU_REFO5CON) Reference clock request is not active (User can update this REFOCON register)  */
#define CRU_REFO5CON_ACTIVE_ACTIVE            (CRU_REFO5CON_ACTIVE_ACTIVE_Val << CRU_REFO5CON_ACTIVE_Pos) /**< (CRU_REFO5CON) Reference clock request is active (User should not update this REFOCON register) Position  */
#define CRU_REFO5CON_ACTIVE_NOT_ACTIVE        (CRU_REFO5CON_ACTIVE_NOT_ACTIVE_Val << CRU_REFO5CON_ACTIVE_Pos) /**< (CRU_REFO5CON) Reference clock request is not active (User can update this REFOCON register) Position  */
#define CRU_REFO5CON_DIVSWEN_Pos              _U_(9)                                               /**< (CRU_REFO5CON) Clock RODIV/ROTRIM switch enabled. Position */
#define CRU_REFO5CON_DIVSWEN_Msk              (_U_(0x1) << CRU_REFO5CON_DIVSWEN_Pos)               /**< (CRU_REFO5CON) Clock RODIV/ROTRIM switch enabled. Mask */
#define CRU_REFO5CON_DIVSWEN(value)           (CRU_REFO5CON_DIVSWEN_Msk & ((value) << CRU_REFO5CON_DIVSWEN_Pos))
#define   CRU_REFO5CON_DIVSWEN_SWINPROGRESS_Val _U_(0x1)                                             /**< (CRU_REFO5CON) Clock Divider Switching currently in progress.  */
#define   CRU_REFO5CON_DIVSWEN_SWCOMPLETE_Val _U_(0x0)                                             /**< (CRU_REFO5CON) Clock Divider Switch has completed.  */
#define CRU_REFO5CON_DIVSWEN_SWINPROGRESS     (CRU_REFO5CON_DIVSWEN_SWINPROGRESS_Val << CRU_REFO5CON_DIVSWEN_Pos) /**< (CRU_REFO5CON) Clock Divider Switching currently in progress. Position  */
#define CRU_REFO5CON_DIVSWEN_SWCOMPLETE       (CRU_REFO5CON_DIVSWEN_SWCOMPLETE_Val << CRU_REFO5CON_DIVSWEN_Pos) /**< (CRU_REFO5CON) Clock Divider Switch has completed. Position  */
#define CRU_REFO5CON_RSLP_Pos                 _U_(11)                                              /**< (CRU_REFO5CON) Reference Oscillator Run in Sleep bit Position */
#define CRU_REFO5CON_RSLP_Msk                 (_U_(0x1) << CRU_REFO5CON_RSLP_Pos)                  /**< (CRU_REFO5CON) Reference Oscillator Run in Sleep bit Mask */
#define CRU_REFO5CON_RSLP(value)              (CRU_REFO5CON_RSLP_Msk & ((value) << CRU_REFO5CON_RSLP_Pos))
#define   CRU_REFO5CON_RSLP_RSLP_Val          _U_(0x1)                                             /**< (CRU_REFO5CON) Reference Oscillator output continues to run in Sleep  */
#define   CRU_REFO5CON_RSLP_NO_RSLP_Val       _U_(0x0)                                             /**< (CRU_REFO5CON) Reference Oscillator output is disabled in Sleep  */
#define CRU_REFO5CON_RSLP_RSLP                (CRU_REFO5CON_RSLP_RSLP_Val << CRU_REFO5CON_RSLP_Pos) /**< (CRU_REFO5CON) Reference Oscillator output continues to run in Sleep Position  */
#define CRU_REFO5CON_RSLP_NO_RSLP             (CRU_REFO5CON_RSLP_NO_RSLP_Val << CRU_REFO5CON_RSLP_Pos) /**< (CRU_REFO5CON) Reference Oscillator output is disabled in Sleep Position  */
#define CRU_REFO5CON_OE_Pos                   _U_(12)                                              /**< (CRU_REFO5CON) Reference Clock Output Enable bit Position */
#define CRU_REFO5CON_OE_Msk                   (_U_(0x1) << CRU_REFO5CON_OE_Pos)                    /**< (CRU_REFO5CON) Reference Clock Output Enable bit Mask */
#define CRU_REFO5CON_OE(value)                (CRU_REFO5CON_OE_Msk & ((value) << CRU_REFO5CON_OE_Pos))
#define   CRU_REFO5CON_OE_REFO5_OE_Val        _U_(0x1)                                             /**< (CRU_REFO5CON) Reference clock is driven out on REFO5 pin  */
#define   CRU_REFO5CON_OE_NO_REFO5_OE_Val     _U_(0x0)                                             /**< (CRU_REFO5CON) Reference clock is not driven out on REFO5 pin.  */
#define CRU_REFO5CON_OE_REFO5_OE              (CRU_REFO5CON_OE_REFO5_OE_Val << CRU_REFO5CON_OE_Pos) /**< (CRU_REFO5CON) Reference clock is driven out on REFO5 pin Position  */
#define CRU_REFO5CON_OE_NO_REFO5_OE           (CRU_REFO5CON_OE_NO_REFO5_OE_Val << CRU_REFO5CON_OE_Pos) /**< (CRU_REFO5CON) Reference clock is not driven out on REFO5 pin. Position  */
#define CRU_REFO5CON_SIDL_Pos                 _U_(13)                                              /**< (CRU_REFO5CON) Peripheral Stop in Idle Mode bit Position */
#define CRU_REFO5CON_SIDL_Msk                 (_U_(0x1) << CRU_REFO5CON_SIDL_Pos)                  /**< (CRU_REFO5CON) Peripheral Stop in Idle Mode bit Mask */
#define CRU_REFO5CON_SIDL(value)              (CRU_REFO5CON_SIDL_Msk & ((value) << CRU_REFO5CON_SIDL_Pos))
#define   CRU_REFO5CON_SIDL_SIDL_Val          _U_(0x1)                                             /**< (CRU_REFO5CON) Discontinue module operation when device enters Idle mode  */
#define   CRU_REFO5CON_SIDL_NO_SIDL_Val       _U_(0x0)                                             /**< (CRU_REFO5CON) Continue module operation in Idle mode  */
#define CRU_REFO5CON_SIDL_SIDL                (CRU_REFO5CON_SIDL_SIDL_Val << CRU_REFO5CON_SIDL_Pos) /**< (CRU_REFO5CON) Discontinue module operation when device enters Idle mode Position  */
#define CRU_REFO5CON_SIDL_NO_SIDL             (CRU_REFO5CON_SIDL_NO_SIDL_Val << CRU_REFO5CON_SIDL_Pos) /**< (CRU_REFO5CON) Continue module operation in Idle mode Position  */
#define CRU_REFO5CON_FRZ_Pos                  _U_(14)                                              /**< (CRU_REFO5CON) Freeze in Debug mode bit Position */
#define CRU_REFO5CON_FRZ_Msk                  (_U_(0x1) << CRU_REFO5CON_FRZ_Pos)                   /**< (CRU_REFO5CON) Freeze in Debug mode bit Mask */
#define CRU_REFO5CON_FRZ(value)               (CRU_REFO5CON_FRZ_Msk & ((value) << CRU_REFO5CON_FRZ_Pos))
#define   CRU_REFO5CON_FRZ_FRZ_Val            _U_(0x1)                                             /**< (CRU_REFO5CON) When emulator is in Debug mode, module freezes operation  */
#define   CRU_REFO5CON_FRZ_NO_FRZ_Val         _U_(0x0)                                             /**< (CRU_REFO5CON) When emulator is in Debug mode, module continues operation  */
#define CRU_REFO5CON_FRZ_FRZ                  (CRU_REFO5CON_FRZ_FRZ_Val << CRU_REFO5CON_FRZ_Pos)   /**< (CRU_REFO5CON) When emulator is in Debug mode, module freezes operation Position  */
#define CRU_REFO5CON_FRZ_NO_FRZ               (CRU_REFO5CON_FRZ_NO_FRZ_Val << CRU_REFO5CON_FRZ_Pos) /**< (CRU_REFO5CON) When emulator is in Debug mode, module continues operation Position  */
#define CRU_REFO5CON_ON_Pos                   _U_(15)                                              /**< (CRU_REFO5CON) Output Enable bit Position */
#define CRU_REFO5CON_ON_Msk                   (_U_(0x1) << CRU_REFO5CON_ON_Pos)                    /**< (CRU_REFO5CON) Output Enable bit Mask */
#define CRU_REFO5CON_ON(value)                (CRU_REFO5CON_ON_Msk & ((value) << CRU_REFO5CON_ON_Pos))
#define   CRU_REFO5CON_ON_ON_Val              _U_(0x1)                                             /**< (CRU_REFO5CON) Reference Oscillator Module enabled  */
#define   CRU_REFO5CON_ON_OFF_Val             _U_(0x0)                                             /**< (CRU_REFO5CON) Reference Oscillator Module disabled  */
#define CRU_REFO5CON_ON_ON                    (CRU_REFO5CON_ON_ON_Val << CRU_REFO5CON_ON_Pos)      /**< (CRU_REFO5CON) Reference Oscillator Module enabled Position  */
#define CRU_REFO5CON_ON_OFF                   (CRU_REFO5CON_ON_OFF_Val << CRU_REFO5CON_ON_Pos)     /**< (CRU_REFO5CON) Reference Oscillator Module disabled Position  */
#define CRU_REFO5CON_RODIV_Pos                _U_(16)                                              /**< (CRU_REFO5CON) Reference Clock Divider bits Position */
#define CRU_REFO5CON_RODIV_Msk                (_U_(0x7FFF) << CRU_REFO5CON_RODIV_Pos)              /**< (CRU_REFO5CON) Reference Clock Divider bits Mask */
#define CRU_REFO5CON_RODIV(value)             (CRU_REFO5CON_RODIV_Msk & ((value) << CRU_REFO5CON_RODIV_Pos))
#define   CRU_REFO5CON_RODIV_65K_Val          _U_(0x7FFF)                                          /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 65,534 (32,767 *2)  */
#define   CRU_REFO5CON_RODIV_4_Val            _U_(0x2)                                             /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 4 (2*2)  */
#define   CRU_REFO5CON_RODIV_2_Val            _U_(0x1)                                             /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 2 (1*2)  */
#define   CRU_REFO5CON_RODIV_NONE_Val         _U_(0x0)                                             /**< (CRU_REFO5CON) REFO5 clock is same frequency as Base clock (no divider)  */
#define CRU_REFO5CON_RODIV_65K                (CRU_REFO5CON_RODIV_65K_Val << CRU_REFO5CON_RODIV_Pos) /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 65,534 (32,767 *2) Position  */
#define CRU_REFO5CON_RODIV_4                  (CRU_REFO5CON_RODIV_4_Val << CRU_REFO5CON_RODIV_Pos) /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 4 (2*2) Position  */
#define CRU_REFO5CON_RODIV_2                  (CRU_REFO5CON_RODIV_2_Val << CRU_REFO5CON_RODIV_Pos) /**< (CRU_REFO5CON) REFO5 clock is Base clock frequency divided by 2 (1*2) Position  */
#define CRU_REFO5CON_RODIV_NONE               (CRU_REFO5CON_RODIV_NONE_Val << CRU_REFO5CON_RODIV_Pos) /**< (CRU_REFO5CON) REFO5 clock is same frequency as Base clock (no divider) Position  */
#define CRU_REFO5CON_Msk                      _U_(0x7FFFFB0F)                                      /**< (CRU_REFO5CON) Register Mask  */


