Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
#define CRU_REFO6CONSET_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO6CONSET) Register Mask  */


/* -------- CRU_REFO6CONINV : (CRU Offset: 0x11C) (R/W 32)  -------- */
#define CRU_REFO6CONINV_RESETVALUE            _U_(0x00)                                            /**<  (CRU_REFO6CONINV)   Reset Value */

#define CRU_REFO6CONINV_Msk                   _U_(0x00000000)                                      /**< (CRU_REFO6CONINV) Register Mask  */


/* -------- CRU_REFO6TRIM : (CRU Offset: 0x120) (R/W 32) REFERENCE OSCILLATOR 6 TRIM REGISTER -------- */
#define CRU_REFO6TRIM_RESETVALUE              _U_(0x00)                                            /**<  (CRU_REFO6TRIM) REFERENCE OSCILLATOR 6 TRIM REGISTER  Reset Value */

#define CRU_REFO6TRIM_ROTRIM_Pos              _U_(23)                                              /**< (CRU_REFO6TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Position */
#define CRU_REFO6TRIM_ROTRIM_Msk              (_U_(0x1FF) << CRU_REFO6TRIM_ROTRIM_Pos)             /**< (CRU_REFO6TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Mask */
#define CRU_REFO6TRIM_ROTRIM(value)           (CRU_REFO6TRIM_ROTRIM_Msk & ((value) << CRU_REFO6TRIM_ROTRIM_Pos))
#define   CRU_REFO6TRIM_ROTRIM_ZERO_Val       _U_(0x0)                                             /**< (CRU_REFO6TRIM) 0/512 (0.0) divisor added to RODIV value  */
#define   CRU_REFO6TRIM_ROTRIM_1_Val          _U_(0x1)                                             /**< (CRU_REFO6TRIM) 1/512 (0.001953125) divisor added to RODIV value  */
#define   CRU_REFO6TRIM_ROTRIM_2_Val          _U_(0x2)                                             /**< (CRU_REFO6TRIM) 2/512 (0.00390625) divisor added to RODIV value  */
#define   CRU_REFO6TRIM_ROTRIM_256_Val        _U_(0x100)                                           /**< (CRU_REFO6TRIM) 256/512 (0.5000) divisor added to RODIV value  */
#define   CRU_REFO6TRIM_ROTRIM_511_Val        _U_(0x1FF)                                           /**< (CRU_REFO6TRIM) 511/512 (0.998046875) divisor added to RODIV value  */
#define CRU_REFO6TRIM_ROTRIM_ZERO             (CRU_REFO6TRIM_ROTRIM_ZERO_Val << CRU_REFO6TRIM_ROTRIM_Pos) /**< (CRU_REFO6TRIM) 0/512 (0.0) divisor added to RODIV value Position  */
#define CRU_REFO6TRIM_ROTRIM_1                (CRU_REFO6TRIM_ROTRIM_1_Val << CRU_REFO6TRIM_ROTRIM_Pos) /**< (CRU_REFO6TRIM) 1/512 (0.001953125) divisor added to RODIV value Position  */
#define CRU_REFO6TRIM_ROTRIM_2                (CRU_REFO6TRIM_ROTRIM_2_Val << CRU_REFO6TRIM_ROTRIM_Pos) /**< (CRU_REFO6TRIM) 2/512 (0.00390625) divisor added to RODIV value Position  */
#define CRU_REFO6TRIM_ROTRIM_256              (CRU_REFO6TRIM_ROTRIM_256_Val << CRU_REFO6TRIM_ROTRIM_Pos) /**< (CRU_REFO6TRIM) 256/512 (0.5000) divisor added to RODIV value Position  */
#define CRU_REFO6TRIM_ROTRIM_511              (CRU_REFO6TRIM_ROTRIM_511_Val << CRU_REFO6TRIM_ROTRIM_Pos) /**< (CRU_REFO6TRIM) 511/512 (0.998046875) divisor added to RODIV value Position  */
#define CRU_REFO6TRIM_Msk                     _U_(0xFF800000)                                      /**< (CRU_REFO6TRIM) Register Mask  */


/* -------- CRU_REFO6TRIMCLR : (CRU Offset: 0x124) (R/W 32)  -------- */
#define CRU_REFO6TRIMCLR_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO6TRIMCLR)   Reset Value */

#define CRU_REFO6TRIMCLR_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO6TRIMCLR) Register Mask  */


/* -------- CRU_REFO6TRIMSET : (CRU Offset: 0x128) (R/W 32)  -------- */
#define CRU_REFO6TRIMSET_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO6TRIMSET)   Reset Value */

#define CRU_REFO6TRIMSET_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO6TRIMSET) Register Mask  */


/* -------- CRU_REFO6TRIMINV : (CRU Offset: 0x12C) (R/W 32)  -------- */
#define CRU_REFO6TRIMINV_RESETVALUE           _U_(0x00)                                            /**<  (CRU_REFO6TRIMINV)   Reset Value */

#define CRU_REFO6TRIMINV_Msk                  _U_(0x00000000)                                      /**< (CRU_REFO6TRIMINV) Register Mask  */


/* -------- CRU_PB1DIV : (CRU Offset: 0x130) (R/W 32) PB1 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB1DIV_RESETVALUE                 _U_(0x8801)                                          /**<  (CRU_PB1DIV) PB1 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB1DIV_PBDIV_Pos                  _U_(0)                                               /**< (CRU_PB1DIV) PB1 Peripheral Clock Divisor Control value Position */
#define CRU_PB1DIV_PBDIV_Msk                  (_U_(0x7F) << CRU_PB1DIV_PBDIV_Pos)                  /**< (CRU_PB1DIV) PB1 Peripheral Clock Divisor Control value Mask */
#define CRU_PB1DIV_PBDIV(value)               (CRU_PB1DIV_PBDIV_Msk & ((value) << CRU_PB1DIV_PBDIV_Pos))
#define   CRU_PB1DIV_PBDIV_DIV1_Val           _U_(0x0)                                             /**< (CRU_PB1DIV) Divide by 1 PB1 Clock same frequency as sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV2_Val           _U_(0x1)                                             /**< (CRU_PB1DIV) Divide by 2 PB1 Clock is 1/2 of sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV3_Val           _U_(0x2)                                             /**< (CRU_PB1DIV) Divide by 3 PB1 Clock is 1/3 of sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV16_Val          _U_(0xF)                                             /**< (CRU_PB1DIV) Divide by 16 PB1 Clock is 1/16 of sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV17_Val          _U_(0x10)                                            /**< (CRU_PB1DIV) Divide by 17 PB1 Clock is 1/17 of sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV127_Val         _U_(0x7E)                                            /**< (CRU_PB1DIV) Divide by 127 PB1 Clock is 1/127 of sys_clk  */
#define   CRU_PB1DIV_PBDIV_DIV128_Val         _U_(0x7F)                                            /**< (CRU_PB1DIV) Divide by 128 PB1 Clock is 1/128 of sys_clk  */
#define CRU_PB1DIV_PBDIV_DIV1                 (CRU_PB1DIV_PBDIV_DIV1_Val << CRU_PB1DIV_PBDIV_Pos)  /**< (CRU_PB1DIV) Divide by 1 PB1 Clock same frequency as sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV2                 (CRU_PB1DIV_PBDIV_DIV2_Val << CRU_PB1DIV_PBDIV_Pos)  /**< (CRU_PB1DIV) Divide by 2 PB1 Clock is 1/2 of sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV3                 (CRU_PB1DIV_PBDIV_DIV3_Val << CRU_PB1DIV_PBDIV_Pos)  /**< (CRU_PB1DIV) Divide by 3 PB1 Clock is 1/3 of sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV16                (CRU_PB1DIV_PBDIV_DIV16_Val << CRU_PB1DIV_PBDIV_Pos) /**< (CRU_PB1DIV) Divide by 16 PB1 Clock is 1/16 of sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV17                (CRU_PB1DIV_PBDIV_DIV17_Val << CRU_PB1DIV_PBDIV_Pos) /**< (CRU_PB1DIV) Divide by 17 PB1 Clock is 1/17 of sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV127               (CRU_PB1DIV_PBDIV_DIV127_Val << CRU_PB1DIV_PBDIV_Pos) /**< (CRU_PB1DIV) Divide by 127 PB1 Clock is 1/127 of sys_clk Position  */
#define CRU_PB1DIV_PBDIV_DIV128               (CRU_PB1DIV_PBDIV_DIV128_Val << CRU_PB1DIV_PBDIV_Pos) /**< (CRU_PB1DIV) Divide by 128 PB1 Clock is 1/128 of sys_clk Position  */
#define CRU_PB1DIV_PBDIVRDY_Pos               _U_(11)                                              /**< (CRU_PB1DIV) PB1 Peripheral Clock Divisor Ready Position */
#define CRU_PB1DIV_PBDIVRDY_Msk               (_U_(0x1) << CRU_PB1DIV_PBDIVRDY_Pos)                /**< (CRU_PB1DIV) PB1 Peripheral Clock Divisor Ready Mask */
#define CRU_PB1DIV_PBDIVRDY(value)            (CRU_PB1DIV_PBDIVRDY_Msk & ((value) << CRU_PB1DIV_PBDIVRDY_Pos))
#define   CRU_PB1DIV_PBDIVRDY_PB1RDY_Val      _U_(0x1)                                             /**< (CRU_PB1DIV) Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written.  */
#define   CRU_PB1DIV_PBDIVRDY_NOT_PB1RDY_Val  _U_(0x0)                                             /**< (CRU_PB1DIV) Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written.  */
#define CRU_PB1DIV_PBDIVRDY_PB1RDY            (CRU_PB1DIV_PBDIVRDY_PB1RDY_Val << CRU_PB1DIV_PBDIVRDY_Pos) /**< (CRU_PB1DIV) Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written. Position  */
#define CRU_PB1DIV_PBDIVRDY_NOT_PB1RDY        (CRU_PB1DIV_PBDIVRDY_NOT_PB1RDY_Val << CRU_PB1DIV_PBDIVRDY_Pos) /**< (CRU_PB1DIV) Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written. Position  */
#define CRU_PB1DIV_PBDIVON_Pos                _U_(15)                                              /**< (CRU_PB1DIV) Output Enable bit Position */
#define CRU_PB1DIV_PBDIVON_Msk                (_U_(0x1) << CRU_PB1DIV_PBDIVON_Pos)                 /**< (CRU_PB1DIV) Output Enable bit Mask */
#define CRU_PB1DIV_PBDIVON(value)             (CRU_PB1DIV_PBDIVON_Msk & ((value) << CRU_PB1DIV_PBDIVON_Pos))
#define   CRU_PB1DIV_PBDIVON_PB1ON_Val        _U_(0x1)                                             /**< (CRU_PB1DIV) PB1 Output clock is enabled  */
#define   CRU_PB1DIV_PBDIVON_PB1OFF_Val       _U_(0x0)                                             /**< (CRU_PB1DIV) PB1 Output clock is disabled  */
#define CRU_PB1DIV_PBDIVON_PB1ON              (CRU_PB1DIV_PBDIVON_PB1ON_Val << CRU_PB1DIV_PBDIVON_Pos) /**< (CRU_PB1DIV) PB1 Output clock is enabled Position  */
#define CRU_PB1DIV_PBDIVON_PB1OFF             (CRU_PB1DIV_PBDIVON_PB1OFF_Val << CRU_PB1DIV_PBDIVON_Pos) /**< (CRU_PB1DIV) PB1 Output clock is disabled Position  */
#define CRU_PB1DIV_Msk                        _U_(0x0000887F)                                      /**< (CRU_PB1DIV) Register Mask  */


/* -------- CRU_PB2DIV : (CRU Offset: 0x140) (R/W 32) PB2 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB2DIV_RESETVALUE                 _U_(0x8801)                                          /**<  (CRU_PB2DIV) PB2 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB2DIV_PBDIV_Pos                  _U_(0)                                               /**< (CRU_PB2DIV) PB2 Peripheral Clock Divisor Control value Position */
#define CRU_PB2DIV_PBDIV_Msk                  (_U_(0x7F) << CRU_PB2DIV_PBDIV_Pos)                  /**< (CRU_PB2DIV) PB2 Peripheral Clock Divisor Control value Mask */
#define CRU_PB2DIV_PBDIV(value)               (CRU_PB2DIV_PBDIV_Msk & ((value) << CRU_PB2DIV_PBDIV_Pos))
#define   CRU_PB2DIV_PBDIV_DIV1_Val           _U_(0x0)                                             /**< (CRU_PB2DIV) Divide by 1 PB2 Clock same frequency as sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV2_Val           _U_(0x1)                                             /**< (CRU_PB2DIV) Divide by 2 PB2 Clock is 1/2 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV3_Val           _U_(0x2)                                             /**< (CRU_PB2DIV) Divide by 3 PB2 Clock is 1/3 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV16_Val          _U_(0xF)                                             /**< (CRU_PB2DIV) Divide by 16 PB2 Clock is 1/16 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV17_Val          _U_(0x10)                                            /**< (CRU_PB2DIV) Divide by 17 PB2 Clock is 1/17 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV127_Val         _U_(0x7E)                                            /**< (CRU_PB2DIV) Divide by 127 PB2 Clock is 1/127 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV128_Val         _U_(0x7F)                                            /**< (CRU_PB2DIV) Divide by 128 PB2 Clock is 1/128 of sys_clk  */
#define CRU_PB2DIV_PBDIV_DIV1                 (CRU_PB2DIV_PBDIV_DIV1_Val << CRU_PB2DIV_PBDIV_Pos)  /**< (CRU_PB2DIV) Divide by 1 PB2 Clock same frequency as sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV2                 (CRU_PB2DIV_PBDIV_DIV2_Val << CRU_PB2DIV_PBDIV_Pos)  /**< (CRU_PB2DIV) Divide by 2 PB2 Clock is 1/2 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV3                 (CRU_PB2DIV_PBDIV_DIV3_Val << CRU_PB2DIV_PBDIV_Pos)  /**< (CRU_PB2DIV) Divide by 3 PB2 Clock is 1/3 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV16                (CRU_PB2DIV_PBDIV_DIV16_Val << CRU_PB2DIV_PBDIV_Pos) /**< (CRU_PB2DIV) Divide by 16 PB2 Clock is 1/16 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV17                (CRU_PB2DIV_PBDIV_DIV17_Val << CRU_PB2DIV_PBDIV_Pos) /**< (CRU_PB2DIV) Divide by 17 PB2 Clock is 1/17 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV127               (CRU_PB2DIV_PBDIV_DIV127_Val << CRU_PB2DIV_PBDIV_Pos) /**< (CRU_PB2DIV) Divide by 127 PB2 Clock is 1/127 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV128               (CRU_PB2DIV_PBDIV_DIV128_Val << CRU_PB2DIV_PBDIV_Pos) /**< (CRU_PB2DIV) Divide by 128 PB2 Clock is 1/128 of sys_clk Position  */
#define CRU_PB2DIV_PBDIVRDY_Pos               _U_(11)                                              /**< (CRU_PB2DIV) PB2 Peripheral Clock Divisor Ready Position */
#define CRU_PB2DIV_PBDIVRDY_Msk               (_U_(0x1) << CRU_PB2DIV_PBDIVRDY_Pos)                /**< (CRU_PB2DIV) PB2 Peripheral Clock Divisor Ready Mask */
#define CRU_PB2DIV_PBDIVRDY(value)            (CRU_PB2DIV_PBDIVRDY_Msk & ((value) << CRU_PB2DIV_PBDIVRDY_Pos))
#define   CRU_PB2DIV_PBDIVRDY_PB2RDY_Val      _U_(0x1)                                             /**< (CRU_PB2DIV) Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written.  */
#define   CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY_Val  _U_(0x0)                                             /**< (CRU_PB2DIV) Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written.  */
#define CRU_PB2DIV_PBDIVRDY_PB2RDY            (CRU_PB2DIV_PBDIVRDY_PB2RDY_Val << CRU_PB2DIV_PBDIVRDY_Pos) /**< (CRU_PB2DIV) Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written. Position  */
#define CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY        (CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY_Val << CRU_PB2DIV_PBDIVRDY_Pos) /**< (CRU_PB2DIV) Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written. Position  */
#define CRU_PB2DIV_PBDIVON_Pos                _U_(15)                                              /**< (CRU_PB2DIV) Output Enable bit Position */
#define CRU_PB2DIV_PBDIVON_Msk                (_U_(0x1) << CRU_PB2DIV_PBDIVON_Pos)                 /**< (CRU_PB2DIV) Output Enable bit Mask */
#define CRU_PB2DIV_PBDIVON(value)             (CRU_PB2DIV_PBDIVON_Msk & ((value) << CRU_PB2DIV_PBDIVON_Pos))
#define   CRU_PB2DIV_PBDIVON_PB2ON_Val        _U_(0x1)                                             /**< (CRU_PB2DIV) PB2 Output clock is enabled  */
#define   CRU_PB2DIV_PBDIVON_PB2OFF_Val       _U_(0x0)                                             /**< (CRU_PB2DIV) PB2 Output clock is disabled  */
#define CRU_PB2DIV_PBDIVON_PB2ON              (CRU_PB2DIV_PBDIVON_PB2ON_Val << CRU_PB2DIV_PBDIVON_Pos) /**< (CRU_PB2DIV) PB2 Output clock is enabled Position  */
#define CRU_PB2DIV_PBDIVON_PB2OFF             (CRU_PB2DIV_PBDIVON_PB2OFF_Val << CRU_PB2DIV_PBDIVON_Pos) /**< (CRU_PB2DIV) PB2 Output clock is disabled Position  */
#define CRU_PB2DIV_Msk                        _U_(0x0000887F)                                      /**< (CRU_PB2DIV) Register Mask  */


