Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_PB3DIV : (CRU Offset: 0x150) (R/W 32) PB3 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB3DIV_RESETVALUE                 _U_(0x8801)                                          /**<  (CRU_PB3DIV) PB3 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB3DIV_PBDIV_Pos                  _U_(0)                                               /**< (CRU_PB3DIV) PB3 Peripheral Clock Divisor Control value Position */
#define CRU_PB3DIV_PBDIV_Msk                  (_U_(0x7F) << CRU_PB3DIV_PBDIV_Pos)                  /**< (CRU_PB3DIV) PB3 Peripheral Clock Divisor Control value Mask */
#define CRU_PB3DIV_PBDIV(value)               (CRU_PB3DIV_PBDIV_Msk & ((value) << CRU_PB3DIV_PBDIV_Pos))
#define   CRU_PB3DIV_PBDIV_DIV1_Val           _U_(0x0)                                             /**< (CRU_PB3DIV) Divide by 1 PB3 Clock same frequency as sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV2_Val           _U_(0x1)                                             /**< (CRU_PB3DIV) Divide by 2 PB3 Clock is 1/2 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV3_Val           _U_(0x2)                                             /**< (CRU_PB3DIV) Divide by 3 PB3 Clock is 1/3 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV16_Val          _U_(0xF)                                             /**< (CRU_PB3DIV) Divide by 16 PB3 Clock is 1/16 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV17_Val          _U_(0x10)                                            /**< (CRU_PB3DIV) Divide by 17 PB3 Clock is 1/17 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV127_Val         _U_(0x7E)                                            /**< (CRU_PB3DIV) Divide by 127 PB3 Clock is 1/127 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV128_Val         _U_(0x7F)                                            /**< (CRU_PB3DIV) Divide by 128 PB3 Clock is 1/128 of sys_clk  */
#define CRU_PB3DIV_PBDIV_DIV1                 (CRU_PB3DIV_PBDIV_DIV1_Val << CRU_PB3DIV_PBDIV_Pos)  /**< (CRU_PB3DIV) Divide by 1 PB3 Clock same frequency as sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV2                 (CRU_PB3DIV_PBDIV_DIV2_Val << CRU_PB3DIV_PBDIV_Pos)  /**< (CRU_PB3DIV) Divide by 2 PB3 Clock is 1/2 of sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV3                 (CRU_PB3DIV_PBDIV_DIV3_Val << CRU_PB3DIV_PBDIV_Pos)  /**< (CRU_PB3DIV) Divide by 3 PB3 Clock is 1/3 of sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV16                (CRU_PB3DIV_PBDIV_DIV16_Val << CRU_PB3DIV_PBDIV_Pos) /**< (CRU_PB3DIV) Divide by 16 PB3 Clock is 1/16 of sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV17                (CRU_PB3DIV_PBDIV_DIV17_Val << CRU_PB3DIV_PBDIV_Pos) /**< (CRU_PB3DIV) Divide by 17 PB3 Clock is 1/17 of sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV127               (CRU_PB3DIV_PBDIV_DIV127_Val << CRU_PB3DIV_PBDIV_Pos) /**< (CRU_PB3DIV) Divide by 127 PB3 Clock is 1/127 of sys_clk Position  */
#define CRU_PB3DIV_PBDIV_DIV128               (CRU_PB3DIV_PBDIV_DIV128_Val << CRU_PB3DIV_PBDIV_Pos) /**< (CRU_PB3DIV) Divide by 128 PB3 Clock is 1/128 of sys_clk Position  */
#define CRU_PB3DIV_PBDIVRDY_Pos               _U_(11)                                              /**< (CRU_PB3DIV) PB3 Peripheral Clock Divisor Ready Position */
#define CRU_PB3DIV_PBDIVRDY_Msk               (_U_(0x1) << CRU_PB3DIV_PBDIVRDY_Pos)                /**< (CRU_PB3DIV) PB3 Peripheral Clock Divisor Ready Mask */
#define CRU_PB3DIV_PBDIVRDY(value)            (CRU_PB3DIV_PBDIVRDY_Msk & ((value) << CRU_PB3DIV_PBDIVRDY_Pos))
#define   CRU_PB3DIV_PBDIVRDY_PB3RDY_Val      _U_(0x1)                                             /**< (CRU_PB3DIV) Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written.  */
#define   CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY_Val  _U_(0x0)                                             /**< (CRU_PB3DIV) Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written.  */
#define CRU_PB3DIV_PBDIVRDY_PB3RDY            (CRU_PB3DIV_PBDIVRDY_PB3RDY_Val << CRU_PB3DIV_PBDIVRDY_Pos) /**< (CRU_PB3DIV) Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written. Position  */
#define CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY        (CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY_Val << CRU_PB3DIV_PBDIVRDY_Pos) /**< (CRU_PB3DIV) Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written. Position  */
#define CRU_PB3DIV_PBDIVON_Pos                _U_(15)                                              /**< (CRU_PB3DIV) Output Enable bit Position */
#define CRU_PB3DIV_PBDIVON_Msk                (_U_(0x1) << CRU_PB3DIV_PBDIVON_Pos)                 /**< (CRU_PB3DIV) Output Enable bit Mask */
#define CRU_PB3DIV_PBDIVON(value)             (CRU_PB3DIV_PBDIVON_Msk & ((value) << CRU_PB3DIV_PBDIVON_Pos))
#define   CRU_PB3DIV_PBDIVON_PB3ON_Val        _U_(0x1)                                             /**< (CRU_PB3DIV) PB3 Output clock is enabled  */
#define   CRU_PB3DIV_PBDIVON_PB3OFF_Val       _U_(0x0)                                             /**< (CRU_PB3DIV) PB3 Output clock is disabled  */
#define CRU_PB3DIV_PBDIVON_PB3ON              (CRU_PB3DIV_PBDIVON_PB3ON_Val << CRU_PB3DIV_PBDIVON_Pos) /**< (CRU_PB3DIV) PB3 Output clock is enabled Position  */
#define CRU_PB3DIV_PBDIVON_PB3OFF             (CRU_PB3DIV_PBDIVON_PB3OFF_Val << CRU_PB3DIV_PBDIVON_Pos) /**< (CRU_PB3DIV) PB3 Output clock is disabled Position  */
#define CRU_PB3DIV_Msk                        _U_(0x0000887F)                                      /**< (CRU_PB3DIV) Register Mask  */


/* -------- CRU_PB1DIVCLR : (CRU Offset: 0x134) (R/W 32)  -------- */
#define CRU_PB1DIVCLR_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB1DIVCLR)   Reset Value */

#define CRU_PB1DIVCLR_Msk                     _U_(0x00000000)                                      /**< (CRU_PB1DIVCLR) Register Mask  */


/* -------- CRU_PB1DIVSET : (CRU Offset: 0x138) (R/W 32)  -------- */
#define CRU_PB1DIVSET_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB1DIVSET)   Reset Value */

#define CRU_PB1DIVSET_Msk                     _U_(0x00000000)                                      /**< (CRU_PB1DIVSET) Register Mask  */


/* -------- CRU_PB1DIVINV : (CRU Offset: 0x13C) (R/W 32)  -------- */
#define CRU_PB1DIVINV_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB1DIVINV)   Reset Value */

#define CRU_PB1DIVINV_Msk                     _U_(0x00000000)                                      /**< (CRU_PB1DIVINV) Register Mask  */


/* -------- CRU_PB2DIVCLR : (CRU Offset: 0x144) (R/W 32)  -------- */
#define CRU_PB2DIVCLR_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB2DIVCLR)   Reset Value */

#define CRU_PB2DIVCLR_Msk                     _U_(0x00000000)                                      /**< (CRU_PB2DIVCLR) Register Mask  */


/* -------- CRU_PB2DIVSET : (CRU Offset: 0x148) (R/W 32)  -------- */
#define CRU_PB2DIVSET_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB2DIVSET)   Reset Value */

#define CRU_PB2DIVSET_Msk                     _U_(0x00000000)                                      /**< (CRU_PB2DIVSET) Register Mask  */


/* -------- CRU_PB2DIVINV : (CRU Offset: 0x14C) (R/W 32)  -------- */
#define CRU_PB2DIVINV_RESETVALUE              _U_(0x00)                                            /**<  (CRU_PB2DIVINV)   Reset Value */

#define CRU_PB2DIVINV_Msk                     _U_(0x00000000)                                      /**< (CRU_PB2DIVINV) Register Mask  */


