Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/* -------- CRU_SLEWCONSET : (CRU Offset: 0x168) (R/W 32)  -------- */
#define CRU_SLEWCONSET_RESETVALUE             _U_(0x00)                                            /**<  (CRU_SLEWCONSET)   Reset Value */

#define CRU_SLEWCONSET_Msk                    _U_(0x00000000)                                      /**< (CRU_SLEWCONSET) Register Mask  */


/* -------- CRU_SLEWCONINV : (CRU Offset: 0x16C) (R/W 32)  -------- */
#define CRU_SLEWCONINV_RESETVALUE             _U_(0x00)                                            /**<  (CRU_SLEWCONINV)   Reset Value */

#define CRU_SLEWCONINV_Msk                    _U_(0x00000000)                                      /**< (CRU_SLEWCONINV) Register Mask  */


/* -------- CRU_CLKSTAT : (CRU Offset: 0x170) (R/W 32) CLOCK STATUS REGISTER -------- */
#define CRU_CLKSTAT_RESETVALUE                _U_(0x00)                                            /**<  (CRU_CLKSTAT) CLOCK STATUS REGISTER  Reset Value */

#define CRU_CLKSTAT_FRCRDY_Pos                _U_(0)                                               /**< (CRU_CLKSTAT) FRC Ready Status value Position */
#define CRU_CLKSTAT_FRCRDY_Msk                (_U_(0x1) << CRU_CLKSTAT_FRCRDY_Pos)                 /**< (CRU_CLKSTAT) FRC Ready Status value Mask */
#define CRU_CLKSTAT_FRCRDY(value)             (CRU_CLKSTAT_FRCRDY_Msk & ((value) << CRU_CLKSTAT_FRCRDY_Pos))
#define   CRU_CLKSTAT_FRCRDY_NOTRDY_Val       _U_(0x0)                                             /**< (CRU_CLKSTAT) FRC is not stable and not ready  */
#define   CRU_CLKSTAT_FRCRDY_RDY_Val          _U_(0x1)                                             /**< (CRU_CLKSTAT) FRC is stable and ready  */
#define CRU_CLKSTAT_FRCRDY_NOTRDY             (CRU_CLKSTAT_FRCRDY_NOTRDY_Val << CRU_CLKSTAT_FRCRDY_Pos) /**< (CRU_CLKSTAT) FRC is not stable and not ready Position  */
#define CRU_CLKSTAT_FRCRDY_RDY                (CRU_CLKSTAT_FRCRDY_RDY_Val << CRU_CLKSTAT_FRCRDY_Pos) /**< (CRU_CLKSTAT) FRC is stable and ready Position  */
#define CRU_CLKSTAT_SPLL1RDY_Pos              _U_(1)                                               /**< (CRU_CLKSTAT) System PLL1 Ready Status value Position */
#define CRU_CLKSTAT_SPLL1RDY_Msk              (_U_(0x1) << CRU_CLKSTAT_SPLL1RDY_Pos)               /**< (CRU_CLKSTAT) System PLL1 Ready Status value Mask */
#define CRU_CLKSTAT_SPLL1RDY(value)           (CRU_CLKSTAT_SPLL1RDY_Msk & ((value) << CRU_CLKSTAT_SPLL1RDY_Pos))
#define   CRU_CLKSTAT_SPLL1RDY_NOTRDY_Val     _U_(0x0)                                             /**< (CRU_CLKSTAT) SPLL1 Primary Output is not stable and not ready  */
#define   CRU_CLKSTAT_SPLL1RDY_RDY_Val        _U_(0x1)                                             /**< (CRU_CLKSTAT) SPLL1 Primary Output is stable and ready  */
#define CRU_CLKSTAT_SPLL1RDY_NOTRDY           (CRU_CLKSTAT_SPLL1RDY_NOTRDY_Val << CRU_CLKSTAT_SPLL1RDY_Pos) /**< (CRU_CLKSTAT) SPLL1 Primary Output is not stable and not ready Position  */
#define CRU_CLKSTAT_SPLL1RDY_RDY              (CRU_CLKSTAT_SPLL1RDY_RDY_Val << CRU_CLKSTAT_SPLL1RDY_Pos) /**< (CRU_CLKSTAT) SPLL1 Primary Output is stable and ready Position  */
#define CRU_CLKSTAT_POSCRDY_Pos               _U_(2)                                               /**< (CRU_CLKSTAT) Primary Oscillator Ready Status value Position */
#define CRU_CLKSTAT_POSCRDY_Msk               (_U_(0x1) << CRU_CLKSTAT_POSCRDY_Pos)                /**< (CRU_CLKSTAT) Primary Oscillator Ready Status value Mask */
#define CRU_CLKSTAT_POSCRDY(value)            (CRU_CLKSTAT_POSCRDY_Msk & ((value) << CRU_CLKSTAT_POSCRDY_Pos))
#define   CRU_CLKSTAT_POSCRDY_NOTRDY_Val      _U_(0x0)                                             /**< (CRU_CLKSTAT) POSC is not stable and not ready  */
#define   CRU_CLKSTAT_POSCRDY_RDY_Val         _U_(0x1)                                             /**< (CRU_CLKSTAT) POSC is stable and ready  */
#define CRU_CLKSTAT_POSCRDY_NOTRDY            (CRU_CLKSTAT_POSCRDY_NOTRDY_Val << CRU_CLKSTAT_POSCRDY_Pos) /**< (CRU_CLKSTAT) POSC is not stable and not ready Position  */
#define CRU_CLKSTAT_POSCRDY_RDY               (CRU_CLKSTAT_POSCRDY_RDY_Val << CRU_CLKSTAT_POSCRDY_Pos) /**< (CRU_CLKSTAT) POSC is stable and ready Position  */
#define CRU_CLKSTAT_SOSCRDY_Pos               _U_(3)                                               /**< (CRU_CLKSTAT) SOSC Ready Status value Position */
#define CRU_CLKSTAT_SOSCRDY_Msk               (_U_(0x1) << CRU_CLKSTAT_SOSCRDY_Pos)                /**< (CRU_CLKSTAT) SOSC Ready Status value Mask */
#define CRU_CLKSTAT_SOSCRDY(value)            (CRU_CLKSTAT_SOSCRDY_Msk & ((value) << CRU_CLKSTAT_SOSCRDY_Pos))
#define   CRU_CLKSTAT_SOSCRDY_NOTRDY_Val      _U_(0x0)                                             /**< (CRU_CLKSTAT) SOSC is not stable and not ready  */
#define   CRU_CLKSTAT_SOSCRDY_RDY_Val         _U_(0x1)                                             /**< (CRU_CLKSTAT) SOSC is stable and ready  */
#define CRU_CLKSTAT_SOSCRDY_NOTRDY            (CRU_CLKSTAT_SOSCRDY_NOTRDY_Val << CRU_CLKSTAT_SOSCRDY_Pos) /**< (CRU_CLKSTAT) SOSC is not stable and not ready Position  */
#define CRU_CLKSTAT_SOSCRDY_RDY               (CRU_CLKSTAT_SOSCRDY_RDY_Val << CRU_CLKSTAT_SOSCRDY_Pos) /**< (CRU_CLKSTAT) SOSC is stable and ready Position  */
#define CRU_CLKSTAT_LPRCRDY_Pos               _U_(5)                                               /**< (CRU_CLKSTAT) LPRC Ready Status value Position */
#define CRU_CLKSTAT_LPRCRDY_Msk               (_U_(0x1) << CRU_CLKSTAT_LPRCRDY_Pos)                /**< (CRU_CLKSTAT) LPRC Ready Status value Mask */
#define CRU_CLKSTAT_LPRCRDY(value)            (CRU_CLKSTAT_LPRCRDY_Msk & ((value) << CRU_CLKSTAT_LPRCRDY_Pos))
#define   CRU_CLKSTAT_LPRCRDY_NOTRDY_Val      _U_(0x0)                                             /**< (CRU_CLKSTAT) LPRC is not stable and not ready  */
#define   CRU_CLKSTAT_LPRCRDY_RDY_Val         _U_(0x1)                                             /**< (CRU_CLKSTAT) LPRC is stable and ready  */
#define CRU_CLKSTAT_LPRCRDY_NOTRDY            (CRU_CLKSTAT_LPRCRDY_NOTRDY_Val << CRU_CLKSTAT_LPRCRDY_Pos) /**< (CRU_CLKSTAT) LPRC is not stable and not ready Position  */
#define CRU_CLKSTAT_LPRCRDY_RDY               (CRU_CLKSTAT_LPRCRDY_RDY_Val << CRU_CLKSTAT_LPRCRDY_Pos) /**< (CRU_CLKSTAT) LPRC is stable and ready Position  */
#define CRU_CLKSTAT_SPLL3RDY_Pos              _U_(9)                                               /**< (CRU_CLKSTAT) System PLL3 Ready Status value Position */
#define CRU_CLKSTAT_SPLL3RDY_Msk              (_U_(0x1) << CRU_CLKSTAT_SPLL3RDY_Pos)               /**< (CRU_CLKSTAT) System PLL3 Ready Status value Mask */
#define CRU_CLKSTAT_SPLL3RDY(value)           (CRU_CLKSTAT_SPLL3RDY_Msk & ((value) << CRU_CLKSTAT_SPLL3RDY_Pos))
#define   CRU_CLKSTAT_SPLL3RDY_NOTRDY_Val     _U_(0x0)                                             /**< (CRU_CLKSTAT) SPLL3 Output is not stable and not ready  */
#define   CRU_CLKSTAT_SPLL3RDY_RDY_Val        _U_(0x1)                                             /**< (CRU_CLKSTAT) SPLL3 Output is stable and ready  */
#define CRU_CLKSTAT_SPLL3RDY_NOTRDY           (CRU_CLKSTAT_SPLL3RDY_NOTRDY_Val << CRU_CLKSTAT_SPLL3RDY_Pos) /**< (CRU_CLKSTAT) SPLL3 Output is not stable and not ready Position  */
#define CRU_CLKSTAT_SPLL3RDY_RDY              (CRU_CLKSTAT_SPLL3RDY_RDY_Val << CRU_CLKSTAT_SPLL3RDY_Pos) /**< (CRU_CLKSTAT) SPLL3 Output is stable and ready Position  */
#define CRU_CLKSTAT_Msk                       _U_(0x0000022F)                                      /**< (CRU_CLKSTAT) Register Mask  */


/* -------- CRU_CLKDIAG : (CRU Offset: 0x190) (R/W 32) USER CLK DIAGNOSTICS CONTROL REGISTER -------- */
#define CRU_CLKDIAG_RESETVALUE                _U_(0x00)                                            /**<  (CRU_CLKDIAG) USER CLK DIAGNOSTICS CONTROL REGISTER  Reset Value */

#define CRU_CLKDIAG_POSCSTOP_Pos              _U_(0)                                               /**< (CRU_CLKDIAG) POSC Clock Stop Control value Position */
#define CRU_CLKDIAG_POSCSTOP_Msk              (_U_(0x1) << CRU_CLKDIAG_POSCSTOP_Pos)               /**< (CRU_CLKDIAG) POSC Clock Stop Control value Mask */
#define CRU_CLKDIAG_POSCSTOP(value)           (CRU_CLKDIAG_POSCSTOP_Msk & ((value) << CRU_CLKDIAG_POSCSTOP_Pos))
#define   CRU_CLKDIAG_POSCSTOP_NORM_Val       _U_(0x0)                                             /**< (CRU_CLKDIAG) POSC clock source runs as normal  */
#define   CRU_CLKDIAG_POSCSTOP_STOP_Val       _U_(0x1)                                             /**< (CRU_CLKDIAG) POSC clock source is stopped  */
#define CRU_CLKDIAG_POSCSTOP_NORM             (CRU_CLKDIAG_POSCSTOP_NORM_Val << CRU_CLKDIAG_POSCSTOP_Pos) /**< (CRU_CLKDIAG) POSC clock source runs as normal Position  */
#define CRU_CLKDIAG_POSCSTOP_STOP             (CRU_CLKDIAG_POSCSTOP_STOP_Val << CRU_CLKDIAG_POSCSTOP_Pos) /**< (CRU_CLKDIAG) POSC clock source is stopped Position  */
#define CRU_CLKDIAG_SOSCSTOP_Pos              _U_(1)                                               /**< (CRU_CLKDIAG) SOSC Clock Stop Control value Position */
#define CRU_CLKDIAG_SOSCSTOP_Msk              (_U_(0x1) << CRU_CLKDIAG_SOSCSTOP_Pos)               /**< (CRU_CLKDIAG) SOSC Clock Stop Control value Mask */
#define CRU_CLKDIAG_SOSCSTOP(value)           (CRU_CLKDIAG_SOSCSTOP_Msk & ((value) << CRU_CLKDIAG_SOSCSTOP_Pos))
#define   CRU_CLKDIAG_SOSCSTOP_NORM_Val       _U_(0x0)                                             /**< (CRU_CLKDIAG) SOSC clock source runs as normal  */
#define   CRU_CLKDIAG_SOSCSTOP_STOP_Val       _U_(0x1)                                             /**< (CRU_CLKDIAG) SOSC clock source is stopped  */
#define CRU_CLKDIAG_SOSCSTOP_NORM             (CRU_CLKDIAG_SOSCSTOP_NORM_Val << CRU_CLKDIAG_SOSCSTOP_Pos) /**< (CRU_CLKDIAG) SOSC clock source runs as normal Position  */
#define CRU_CLKDIAG_SOSCSTOP_STOP             (CRU_CLKDIAG_SOSCSTOP_STOP_Val << CRU_CLKDIAG_SOSCSTOP_Pos) /**< (CRU_CLKDIAG) SOSC clock source is stopped Position  */
#define CRU_CLKDIAG_FRCSTOP_Pos               _U_(2)                                               /**< (CRU_CLKDIAG) FRC Clock Stop Control value Position */
#define CRU_CLKDIAG_FRCSTOP_Msk               (_U_(0x1) << CRU_CLKDIAG_FRCSTOP_Pos)                /**< (CRU_CLKDIAG) FRC Clock Stop Control value Mask */
#define CRU_CLKDIAG_FRCSTOP(value)            (CRU_CLKDIAG_FRCSTOP_Msk & ((value) << CRU_CLKDIAG_FRCSTOP_Pos))
#define   CRU_CLKDIAG_FRCSTOP_NORM_Val        _U_(0x0)                                             /**< (CRU_CLKDIAG) FRC clock source runs as normal  */
#define   CRU_CLKDIAG_FRCSTOP_STOP_Val        _U_(0x1)                                             /**< (CRU_CLKDIAG) FRC clock source is stopped  */
#define CRU_CLKDIAG_FRCSTOP_NORM              (CRU_CLKDIAG_FRCSTOP_NORM_Val << CRU_CLKDIAG_FRCSTOP_Pos) /**< (CRU_CLKDIAG) FRC clock source runs as normal Position  */
#define CRU_CLKDIAG_FRCSTOP_STOP              (CRU_CLKDIAG_FRCSTOP_STOP_Val << CRU_CLKDIAG_FRCSTOP_Pos) /**< (CRU_CLKDIAG) FRC clock source is stopped Position  */
#define CRU_CLKDIAG_LPRCSTOP_Pos              _U_(3)                                               /**< (CRU_CLKDIAG) LPRC Clock Stop Control value Position */
#define CRU_CLKDIAG_LPRCSTOP_Msk              (_U_(0x1) << CRU_CLKDIAG_LPRCSTOP_Pos)               /**< (CRU_CLKDIAG) LPRC Clock Stop Control value Mask */
#define CRU_CLKDIAG_LPRCSTOP(value)           (CRU_CLKDIAG_LPRCSTOP_Msk & ((value) << CRU_CLKDIAG_LPRCSTOP_Pos))
#define   CRU_CLKDIAG_LPRCSTOP_NORM_Val       _U_(0x0)                                             /**< (CRU_CLKDIAG) LPRC clock source runs as normal  */
#define   CRU_CLKDIAG_LPRCSTOP_STOP_Val       _U_(0x1)                                             /**< (CRU_CLKDIAG) LPRC clock source is stopped  */
#define CRU_CLKDIAG_LPRCSTOP_NORM             (CRU_CLKDIAG_LPRCSTOP_NORM_Val << CRU_CLKDIAG_LPRCSTOP_Pos) /**< (CRU_CLKDIAG) LPRC clock source runs as normal Position  */
#define CRU_CLKDIAG_LPRCSTOP_STOP             (CRU_CLKDIAG_LPRCSTOP_STOP_Val << CRU_CLKDIAG_LPRCSTOP_Pos) /**< (CRU_CLKDIAG) LPRC clock source is stopped Position  */
#define CRU_CLKDIAG_SPLL1STOP_Pos             _U_(4)                                               /**< (CRU_CLKDIAG) SPLL1 Clock Stop Control value Position */
#define CRU_CLKDIAG_SPLL1STOP_Msk             (_U_(0x1) << CRU_CLKDIAG_SPLL1STOP_Pos)              /**< (CRU_CLKDIAG) SPLL1 Clock Stop Control value Mask */
#define CRU_CLKDIAG_SPLL1STOP(value)          (CRU_CLKDIAG_SPLL1STOP_Msk & ((value) << CRU_CLKDIAG_SPLL1STOP_Pos))
#define   CRU_CLKDIAG_SPLL1STOP_NORM_Val      _U_(0x0)                                             /**< (CRU_CLKDIAG) SPLL1 clock source runs as normal  */
#define   CRU_CLKDIAG_SPLL1STOP_STOP_Val      _U_(0x1)                                             /**< (CRU_CLKDIAG) SPLL1 clock source is stopped  */
#define CRU_CLKDIAG_SPLL1STOP_NORM            (CRU_CLKDIAG_SPLL1STOP_NORM_Val << CRU_CLKDIAG_SPLL1STOP_Pos) /**< (CRU_CLKDIAG) SPLL1 clock source runs as normal Position  */
#define CRU_CLKDIAG_SPLL1STOP_STOP            (CRU_CLKDIAG_SPLL1STOP_STOP_Val << CRU_CLKDIAG_SPLL1STOP_Pos) /**< (CRU_CLKDIAG) SPLL1 clock source is stopped Position  */
#define CRU_CLKDIAG_SPLL2STOP_Pos             _U_(5)                                               /**< (CRU_CLKDIAG) SPLL2 Clock Stop Control value Position */
#define CRU_CLKDIAG_SPLL2STOP_Msk             (_U_(0x1) << CRU_CLKDIAG_SPLL2STOP_Pos)              /**< (CRU_CLKDIAG) SPLL2 Clock Stop Control value Mask */
#define CRU_CLKDIAG_SPLL2STOP(value)          (CRU_CLKDIAG_SPLL2STOP_Msk & ((value) << CRU_CLKDIAG_SPLL2STOP_Pos))
#define   CRU_CLKDIAG_SPLL2STOP_NORM_Val      _U_(0x0)                                             /**< (CRU_CLKDIAG) SPLL2 clock source runs as normal  */
#define   CRU_CLKDIAG_SPLL2STOP_STOP_Val      _U_(0x1)                                             /**< (CRU_CLKDIAG) SPLL2 clock source is stopped  */
#define CRU_CLKDIAG_SPLL2STOP_NORM            (CRU_CLKDIAG_SPLL2STOP_NORM_Val << CRU_CLKDIAG_SPLL2STOP_Pos) /**< (CRU_CLKDIAG) SPLL2 clock source runs as normal Position  */
#define CRU_CLKDIAG_SPLL2STOP_STOP            (CRU_CLKDIAG_SPLL2STOP_STOP_Val << CRU_CLKDIAG_SPLL2STOP_Pos) /**< (CRU_CLKDIAG) SPLL2 clock source is stopped Position  */
#define CRU_CLKDIAG_SPLL3STOP_Pos             _U_(6)                                               /**< (CRU_CLKDIAG) SPLL3 Clock Stop Control value Position */
#define CRU_CLKDIAG_SPLL3STOP_Msk             (_U_(0x1) << CRU_CLKDIAG_SPLL3STOP_Pos)              /**< (CRU_CLKDIAG) SPLL3 Clock Stop Control value Mask */
#define CRU_CLKDIAG_SPLL3STOP(value)          (CRU_CLKDIAG_SPLL3STOP_Msk & ((value) << CRU_CLKDIAG_SPLL3STOP_Pos))
#define   CRU_CLKDIAG_SPLL3STOP_NORM_Val      _U_(0x0)                                             /**< (CRU_CLKDIAG) SPLL3 clock source runs as normal  */
#define   CRU_CLKDIAG_SPLL3STOP_STOP_Val      _U_(0x1)                                             /**< (CRU_CLKDIAG) SPLL3 clock source is stopped  */
#define CRU_CLKDIAG_SPLL3STOP_NORM            (CRU_CLKDIAG_SPLL3STOP_NORM_Val << CRU_CLKDIAG_SPLL3STOP_Pos) /**< (CRU_CLKDIAG) SPLL3 clock source runs as normal Position  */
#define CRU_CLKDIAG_SPLL3STOP_STOP            (CRU_CLKDIAG_SPLL3STOP_STOP_Val << CRU_CLKDIAG_SPLL3STOP_Pos) /**< (CRU_CLKDIAG) SPLL3 clock source is stopped Position  */
#define CRU_CLKDIAG_NMICNT_Pos                _U_(16)                                              /**< (CRU_CLKDIAG) NMI Counter value Position */
#define CRU_CLKDIAG_NMICNT_Msk                (_U_(0xFFFF) << CRU_CLKDIAG_NMICNT_Pos)              /**< (CRU_CLKDIAG) NMI Counter value Mask */
#define CRU_CLKDIAG_NMICNT(value)             (CRU_CLKDIAG_NMICNT_Msk & ((value) << CRU_CLKDIAG_NMICNT_Pos))
#define CRU_CLKDIAG_Msk                       _U_(0xFFFF007F)                                      /**< (CRU_CLKDIAG) Register Mask  */


