Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/cru.h
/** \brief CRU register offsets definitions */
#define CRU_OSCCON_REG_OFST            (0x00)              /**< (CRU_OSCCON) CRU OSCILLATOR CONTROL REGISTER Offset */
#define CRU_OSCCONCLR_REG_OFST         (0x04)              /**< (CRU_OSCCONCLR)  Offset */
#define CRU_OSCCONSET_REG_OFST         (0x08)              /**< (CRU_OSCCONSET)  Offset */
#define CRU_OSCCONINV_REG_OFST         (0x0C)              /**< (CRU_OSCCONINV)  Offset */
#define CRU_OSCTUN_REG_OFST            (0x10)              /**< (CRU_OSCTUN) CRU OSCILLATOR TRIMMING REGISTER Offset */
#define CRU_OSCTUNCLR_REG_OFST         (0x14)              /**< (CRU_OSCTUNCLR)  Offset */
#define CRU_OSCTUNSET_REG_OFST         (0x18)              /**< (CRU_OSCTUNSET)  Offset */
#define CRU_OSCTUNINV_REG_OFST         (0x1C)              /**< (CRU_OSCTUNINV)  Offset */
#define CRU_SPLLCON_REG_OFST           (0x20)              /**< (CRU_SPLLCON) SPLL CONTROL REGISTER Offset */
#define CRU_SPLLCONCLR_REG_OFST        (0x24)              /**< (CRU_SPLLCONCLR)  Offset */
#define CRU_SPLLCONSET_REG_OFST        (0x28)              /**< (CRU_SPLLCONSET)  Offset */
#define CRU_SPLLCONINV_REG_OFST        (0x2C)              /**< (CRU_SPLLCONINV)  Offset */
#define CRU_REFO1CON_REG_OFST          (0x70)              /**< (CRU_REFO1CON) REFERENCE OSCILLATOR 1 CONTROL REGISTER Offset */
#define CRU_REFO1CONCLR_REG_OFST       (0x74)              /**< (CRU_REFO1CONCLR)  Offset */
#define CRU_REFO1CONSET_REG_OFST       (0x78)              /**< (CRU_REFO1CONSET)  Offset */
#define CRU_REFO1CONINV_REG_OFST       (0x7C)              /**< (CRU_REFO1CONINV)  Offset */
#define CRU_REFO1TRIM_REG_OFST         (0x80)              /**< (CRU_REFO1TRIM) REFERENCE OSCILLATOR 1 TRIM REGISTER Offset */
#define CRU_REFO1TRIMCLR_REG_OFST      (0x84)              /**< (CRU_REFO1TRIMCLR)  Offset */
#define CRU_REFO1TRIMSET_REG_OFST      (0x88)              /**< (CRU_REFO1TRIMSET)  Offset */
#define CRU_REFO1TRIMINV_REG_OFST      (0x8C)              /**< (CRU_REFO1TRIMINV)  Offset */
#define CRU_REFO2CON_REG_OFST          (0x90)              /**< (CRU_REFO2CON) REFERENCE OSCILLATOR 2 CONTROL REGISTER Offset */
#define CRU_REFO2CONCLR_REG_OFST       (0x94)              /**< (CRU_REFO2CONCLR)  Offset */
#define CRU_REFO2CONSET_REG_OFST       (0x98)              /**< (CRU_REFO2CONSET)  Offset */
#define CRU_REFO2CONINV_REG_OFST       (0x9C)              /**< (CRU_REFO2CONINV)  Offset */
#define CRU_REFO2TRIM_REG_OFST         (0xA0)              /**< (CRU_REFO2TRIM) REFERENCE OSCILLATOR 2 TRIM REGISTER Offset */
#define CRU_REFO2TRIMCLR_REG_OFST      (0xA4)              /**< (CRU_REFO2TRIMCLR)  Offset */
#define CRU_REFO2TRIMSET_REG_OFST      (0xA8)              /**< (CRU_REFO2TRIMSET)  Offset */
#define CRU_REFO2TRIMINV_REG_OFST      (0xAC)              /**< (CRU_REFO2TRIMINV)  Offset */
#define CRU_REFO3CON_REG_OFST          (0xB0)              /**< (CRU_REFO3CON) REFERENCE OSCILLATOR 3 CONTROL REGISTER Offset */
#define CRU_REFO3CONCLR_REG_OFST       (0xB4)              /**< (CRU_REFO3CONCLR)  Offset */
#define CRU_REFO3CONSET_REG_OFST       (0xB8)              /**< (CRU_REFO3CONSET)  Offset */
#define CRU_REFO3CONINV_REG_OFST       (0xBC)              /**< (CRU_REFO3CONINV)  Offset */
#define CRU_REFO3TRIM_REG_OFST         (0xC0)              /**< (CRU_REFO3TRIM) REFERENCE OSCILLATOR 3 TRIM REGISTER Offset */
#define CRU_REFO3TRIMCLR_REG_OFST      (0xC4)              /**< (CRU_REFO3TRIMCLR)  Offset */
#define CRU_REFO3TRIMSET_REG_OFST      (0xC8)              /**< (CRU_REFO3TRIMSET)  Offset */
#define CRU_REFO3TRIMINV_REG_OFST      (0xCC)              /**< (CRU_REFO3TRIMINV)  Offset */
#define CRU_REFO4CON_REG_OFST          (0xD0)              /**< (CRU_REFO4CON) REFERENCE OSCILLATOR 4 CONTROL REGISTER Offset */
#define CRU_REFO4CONCLR_REG_OFST       (0xD4)              /**< (CRU_REFO4CONCLR)  Offset */
#define CRU_REFO4CONSET_REG_OFST       (0xD8)              /**< (CRU_REFO4CONSET)  Offset */
#define CRU_REFO4CONINV_REG_OFST       (0xDC)              /**< (CRU_REFO4CONINV)  Offset */
#define CRU_REFO4TRIM_REG_OFST         (0xE0)              /**< (CRU_REFO4TRIM) REFERENCE OSCILLATOR 4 TRIM REGISTER Offset */
#define CRU_REFO4TRIMCLR_REG_OFST      (0xE4)              /**< (CRU_REFO4TRIMCLR)  Offset */
#define CRU_REFO4TRIMSET_REG_OFST      (0xE8)              /**< (CRU_REFO4TRIMSET)  Offset */
#define CRU_REFO4TRIMINV_REG_OFST      (0xEC)              /**< (CRU_REFO4TRIMINV)  Offset */
#define CRU_REFO5CON_REG_OFST          (0xF0)              /**< (CRU_REFO5CON) REFERENCE OSCILLATOR 5 CONTROL REGISTER Offset */
#define CRU_REFO5CONCLR_REG_OFST       (0xF4)              /**< (CRU_REFO5CONCLR)  Offset */
#define CRU_REFO5CONSET_REG_OFST       (0xF8)              /**< (CRU_REFO5CONSET)  Offset */
#define CRU_REFO5CONINV_REG_OFST       (0xFC)              /**< (CRU_REFO5CONINV)  Offset */
#define CRU_REFO5TRIM_REG_OFST         (0x100)             /**< (CRU_REFO5TRIM) REFERENCE OSCILLATOR 5 TRIM REGISTER Offset */
#define CRU_REFO5TRIMCLR_REG_OFST      (0x104)             /**< (CRU_REFO5TRIMCLR)  Offset */
#define CRU_REFO5TRIMSET_REG_OFST      (0x108)             /**< (CRU_REFO5TRIMSET)  Offset */
#define CRU_REFO5TRIMINV_REG_OFST      (0x10C)             /**< (CRU_REFO5TRIMINV)  Offset */
#define CRU_REFO6CON_REG_OFST          (0x110)             /**< (CRU_REFO6CON) REFERENCE OSCILLATOR 6 CONTROL REGISTER Offset */
#define CRU_REFO6CONCLR_REG_OFST       (0x114)             /**< (CRU_REFO6CONCLR)  Offset */
#define CRU_REFO6CONSET_REG_OFST       (0x118)             /**< (CRU_REFO6CONSET)  Offset */
#define CRU_REFO6CONINV_REG_OFST       (0x11C)             /**< (CRU_REFO6CONINV)  Offset */
#define CRU_REFO6TRIM_REG_OFST         (0x120)             /**< (CRU_REFO6TRIM) REFERENCE OSCILLATOR 6 TRIM REGISTER Offset */
#define CRU_REFO6TRIMCLR_REG_OFST      (0x124)             /**< (CRU_REFO6TRIMCLR)  Offset */
#define CRU_REFO6TRIMSET_REG_OFST      (0x128)             /**< (CRU_REFO6TRIMSET)  Offset */
#define CRU_REFO6TRIMINV_REG_OFST      (0x12C)             /**< (CRU_REFO6TRIMINV)  Offset */
#define CRU_PB1DIV_REG_OFST            (0x130)             /**< (CRU_PB1DIV) PB1 CLOCK DIVISOR CONTROL REGISTER Offset */
#define CRU_PB2DIV_REG_OFST            (0x140)             /**< (CRU_PB2DIV) PB2 CLOCK DIVISOR CONTROL REGISTER Offset */
#define CRU_PB3DIV_REG_OFST            (0x150)             /**< (CRU_PB3DIV) PB3 CLOCK DIVISOR CONTROL REGISTER Offset */
#define CRU_PB1DIVCLR_REG_OFST         (0x134)             /**< (CRU_PB1DIVCLR)  Offset */
#define CRU_PB1DIVSET_REG_OFST         (0x138)             /**< (CRU_PB1DIVSET)  Offset */
#define CRU_PB1DIVINV_REG_OFST         (0x13C)             /**< (CRU_PB1DIVINV)  Offset */
#define CRU_PB2DIVCLR_REG_OFST         (0x144)             /**< (CRU_PB2DIVCLR)  Offset */
#define CRU_PB2DIVSET_REG_OFST         (0x148)             /**< (CRU_PB2DIVSET)  Offset */
#define CRU_PB2DIVINV_REG_OFST         (0x14C)             /**< (CRU_PB2DIVINV)  Offset */
#define CRU_PB3DIVCLR_REG_OFST         (0x154)             /**< (CRU_PB3DIVCLR)  Offset */
#define CRU_PB3DIVSET_REG_OFST         (0x158)             /**< (CRU_PB3DIVSET)  Offset */
#define CRU_PB3DIVINV_REG_OFST         (0x15C)             /**< (CRU_PB3DIVINV)  Offset */
#define CRU_SLEWCON_REG_OFST           (0x160)             /**< (CRU_SLEWCON) SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER Offset */
#define CRU_SLEWCONCLR_REG_OFST        (0x164)             /**< (CRU_SLEWCONCLR)  Offset */
#define CRU_SLEWCONSET_REG_OFST        (0x168)             /**< (CRU_SLEWCONSET)  Offset */
#define CRU_SLEWCONINV_REG_OFST        (0x16C)             /**< (CRU_SLEWCONINV)  Offset */
#define CRU_CLKSTAT_REG_OFST           (0x170)             /**< (CRU_CLKSTAT) CLOCK STATUS REGISTER Offset */
#define CRU_CLKDIAG_REG_OFST           (0x190)             /**< (CRU_CLKDIAG) USER CLK DIAGNOSTICS CONTROL REGISTER Offset */

